const ENEMY_NAMES_GENERIC_KR = [
	// Korean
	"렌", "조지", "파티", "알렉스", "코스타", "엘리야", "콘스탄틴", "롤랑", "헤닝", "로드릭", 
	"케이", "이씨", "밥", "허씨", "박씨", "김씨", "제임스", "로버트", "존", "밍", 
	"헤닝", "제임스", "워싱턴", "아말", "엘리야", "이사야", "알렉산더", "알렉산드로", "아서", "모르건", 
	"오말", "카힘", "타힘", "쿠엔틴", "단", "밀러", "루카스", "사히마", "파티마", "타로", 
	"아시프", "준호", "성", "헤이단", "솔로몬", "알리", "욘더", "블록", "해머", "하라", "아스맛", "나심", "마일스", "지오", "스톤", "타로", 
	"레드", "옐로우", "그린", "블루", "조셉", "조스", "카이사르", "시저", "카멘", "야센", "양", "휴고", "레이먼", "카일", "올레그", "앙거스", 
	"보리스", "루이", "진폴", "미야자키", "타로", "파운드", "제노", "제스트", "움프", "울프", "코네컷", "루이스", "루시", "바드", "플로이트", "듀이"
];

const ENEMY_NAMES_THUG_KR = [
	// Korean
	"쌍칼", "사시미", "빠따", "박씨", "김씨", "개새끼", "들박이", "박치기", "쫌생이", 
	"각목", "곽씨", "차씨", "강씨", "개씨", "견씨", "망치", "깡개", "깡따구", "잭", 
	"송곳", "쇠도끼", "사슬", "싸다귀", "싸가지", "미친개", "독뱀", "또라이", "사기꾼", "도둑놈", "졸개",
	"알", "카포네", "카를로"
];

const ENEMY_NAMES_GOBLIN_KR = [
	// Korean
	"고브일", "고브이", "고브삼", "고브사", "고브오", "고브육", "고브칠", "고브팔", "고브구", "고브십", 
	"가가", "나나", "다다", "라라", "사사", "아아", "자자", "차차", "타타", "카카", 
	"릴리퍼트", "브루딩낵", "글럼달크리치", "걸리버", "레가도", "라퓨타", "라가도", "무노디", "야후", "휴이넘", 
	"돈페드로", "블루퍼시디언", "버튼", "리차드", "베이트", "플림냅", "렐드리설", "볼골램", "트라멕슨", "슬라멕슨"
];

const ENEMY_NAMES_NERD_KR = [
	// Korean
	"아키라", "히카리", "다나카", "다무라", "무라사키", "히지타카", "코이츠", "죠가사키", "히구치", "쿠미카와", 
	"센토", "부자마", "센베", "사기사와", "가츠동", "스바루", "히사시부리", "이토", "야마다", "야마모토", 
	"코바야시", "사사키", "키노", "키요미", "타카하시", "코이시", "오이시", "사쿠라", "호조", 
	"잇빠치", "미미쨔응", "마루야마", "무라타", "키무라", "키노시타", "모리쿠보", "우즈마키", "우즈키", "혼다", 
	"하루카", "나나", "사쿠라다", "사쿠라이", "타마미", "요리타", "시농", "미후네", "오오누마", "박준영" 
];

const ENEMY_NAMES_ROGUE_KR = [
	// Korean
	"코너", "루팡", "홍길동", "임꺽정", "장길산", "전우치", "고에몬", "로빈", "조로", 
	"스틸레토", "대거", "잠비야", "모닝스타", "비치화", "샴시르", "시미터", "사브르", "세이버", "글라디우스", 
	"스쿠툼", "카타르", "레이피어", "야타간", "탈와르", "필룸", "페퍼", "액스", "케페시", "란케아", 
	"색스", "바제라드", "볼록", "론델", "구르즈", "아틀라틀", "마콰이틀", "치말리", "뒤삭", "칸다" 
];

const ENEMY_NAMES_HOMELESS_KR = [
	// Korean
	"왕점", "뻐드렁니", "주걱턱", "주근깨", "마빡", "늙은이", "제비", "추씨", "동씨", "판씨", 
	"안짱다리", "돌머리", "쏠감팽", "쭈꾸미", "망둥이", "뱁새", "현씨", "호씨", "홍씨", 
	"황씨", "갈씨", "울보", "시이타케", "크리미노", "마이타케", "에노키", "석이", "팽이", 
	"엘크혼", "치마", "표고", "송로", "상황", "영지", "곰보", "트러프", "홉" 
];

const ENEMY_NAMES_LIZARDMAN_KR = [
	// Korean
	"메이스", "스케일", "알빈", "에이온", "도카게", "리잘", "디노", "다이노", "카이만", 
	"아구아나", "이구아나", "아르만", "겍코", "아구모르파", "라세토르다", "트리케라", "스테고", "안킬로", "켄트로", 
	"에오랍토르", "구안", "기가노토", "기간토랍", "데이노니쿠스", "프테로", "마멘키", "브라키오", "디플로도", "살라타", 
	"티렉스", "브론토", "파타고", "알라모", "케티오", "다켄트", "렉소비", "카스모" 
];

const ENEMY_NAMES_ORC_KR = [
	// Korean
	"서로인", "테바사키", "립", "텐더로인", "햄", "피크닉", "아카시아", "발사", 
	"월넛", "엘름", "사태", "항정", "소세지", "가브리", "메이플", "틱", "올리브", "마구리", 
	"차돌", "부채", "포플러", "마호가니", "추리", "아롱", "우둔", "양지", "파인", 
	"버치", "우드", "천엽", "히코리", "우설", "우지", "하몬", "타타르", "치차론", "훠궈", "코치니요" 
];

const ENEMY_NAMES_WEREWOLF_KR = [
	// Korean
	"마르티즈", "비글", "퍼그", "스피즈", "달마", "테리어", "슈나우저", 
	"코기", "콜리", "테리", "허스키", "리트리버", "흑구", "레드", "재규어", 
	"그레이", "블랙", "코요", "아틱", "웨스턴", "레드", "퓨마", 
	"로물루스", "레무스", "불페", "페넥", "티베탄"
];

const ENEMY_NAMES_YETI_KR = [
	// Korean
	"베어", "고마", "우르시드", "오네터스", "스노위", "시드", "선", "슬로스", "브라운", "폴라", 
	"허그", "포그", "다운", "리넨", "캐시", "울루", "실키", "테리", "포플린", "진", 
	"웨터", "코니", "니티", "우븐", "쉬폰", "새틴", "벨벳", "시네틱", "카본" 
];

const ENEMY_NAMES_SLIME_KR = [
	// Korean
	"슬라미", "젤리", "리퀴드", "스이긴", "워터", "머큐리", "마르스", "퐁듀", "캐니아", "아우렐리아", 
	"노무라", "네모필레마", "젤리피쉬", "크로소타", "키로살무스", "크리오넥스", "클리오네", "코틸로히자", "아툴라", "세피아", 
	"드링크", "젤라틴", "캐비어", "소다", "바운시", "슬로위", "그레기오", "민치", "코크", "테일", 
	"엘리", "스네일", "헬릭스", "림네이아", "슬러그", "가립", "피", "오이스터", "쇼고스", "옵시더스" 
];
const ENEMY_NAMES_VISITOR_MALE_KR = [
	// Korean added 2022.06.10
	"오말", "네이트", "펠릭스", "메이슨", "제이슨", "테일러", "밀로", "마일스", "이치죠", "신지", "밀러", 
	"타일러", "버틀러", "요한슨", "지로", "이카리", "사이먼", "시몬", "로이드", "로저", "엘로이", "자크", 
	"페트르", "표트르", "사일러", "알", "카힘", "필로테테스", "민수", "레오나르", "크라토스", "파리스", "필립"
];
const ENEMY_NAMES_VISITOR_FEMALE_KR = [
	// Korean
	"켈리", "릴리", "마리아", "리타", "콜리나", "놀라나", "비트리스", "아이리", "프란", 
	"메이", "록산나", "리사", "제인", "제나", "릴리스", "미샤", "하나코", "린", "앤", 
	"불린", "스키타", "미쿠", "마리사", "이케자와", "이바라자키", "사토", "소라", "리바", "노라", 
	"로사", "로자", "미나미", "스미레", "세이지", "레이나", "히지리", "시즈쿠", "나기", "시키" 
];

const ENEMY_NAMES_VISITOR_UNISEX_KR = [
	// Korean
	"쿠인", "보트", "루카", "큐르", "라미", "죠비", "네이세", "로로", "루", "쿠", 
	"시노부", "테즈카", "하카미치" 
];

//-15% all stats
const ENEMY_PREFIX_BAD_KR = [
	// Korean
	"수수", "불결", "약한", "촌스러운", "변비걸린", "허약체", "자코", "요통걸린", "비틀비틀", "허접" 
];
const ENEMY_PREFIX_DRUNK_KR = [
	// Korean
	"주정뱅이", "곤드레만드레", "만취한", "한잔한", "취한", "헤롱헤롱" 
];
//-15% all stats, -1 ejaculation stock
const ENEMY_PREFIX_HUNGRY_KR = [
	// Korean
	"배고픈", "굶은", "다이어트중", "아침 거른" 
];
//-25% all stats, -1 ejaculation stock
const ENEMY_PREFIX_STARVING_KR = [
	// Korean
	"빼빼", "수수깡", "갈빗대", "깡마른", "뼈나온", "허약체질" 
];
//-25% Strength, -15% Stamina
const ENEMY_PREFIX_WEAK_KR = [
	// Korean
	"허약", "빈약", "저체력", "운동부족", "잡몹", "약해빠진", "최약체", "뱃살" 
];
//-25% Dexterity, -10% Energy
const ENEMY_PREFIX_INEPT_KR = [
	// Korean
	"서투른", "서툰", "재주없는", "솜씨없는", "짤뚱한", "마디자지", "짤막한" 
];
//-25% Agility
const ENEMY_PREFIX_SLOW_KR = [
	// Korean
	"굼벵이", "게으름뱅이", "느려터진", "하체허약", "깡마른", "완행차" 
];
//-25% Endurance, -10% Stamina, -15% Energy, -1 ejaculation stock
const ENEMY_PREFIX_SENSITIVE_KR = [
	// Korean
	"민감", "조루", "이른", "빠른", "인내박약", "참을성없는", "근성부족", "줄줄새는" 
];

//+15% All Stats, +25% Stamina, +15% Ejaculation Volume
const ENEMY_PREFIX_GOOD_KR = [
	// Korean
	"강적", "우수", "레슬러", "잘하는", "실력자", "실력좋은" 
];
//+30% All Stats, +35% Stamina, +50% Energy, +25% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_ELITE_KR = [
	// Korean
	"엘리트", "일급", "챔피언", "무적", "무패", "무적의", "두려운", "완전체" 
];
//+30% Strength, +15% Stamina
const ENEMY_PREFIX_STRONG_KR = [
	// Korean
	"힘센", "근육질", "건강체질", "단백질풍부", "천하장사", "기운센", "마초" 
];
//+30% Dexterity, +10% Energy
const ENEMY_PREFIX_DEXTEROUS_KR = [
	// Korean
	"재주꾼", "재주좋은", "근육질손가락", "기술자", "테크니션", "손놀림" 
];
//+30% Agility
const ENEMY_PREFIX_AGILE_KR = [
	// Korean
	"재빠른", "신속", "광속", "속도광", "질풍", "괴도" 
];
//+30% Endurance, +35% Stamina, +25% Energy, +25% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_ENDURING_KR = [
	// Korean
	"인내심많은", "잘 참는", "인내력", "질긴", "참을성좋은" 
];

//-25% Dexterity, -25% Endurance, +50% Energy
//With passives: -50% Charm, +50% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_VIRGIN_KR = [
	// Korean
	"동정", "미경험" 
];

//+10% Strength, +10% Dexterity, +10% Agility, -50% Charm, Starts the battle with the Horny state
const ENEMY_PREFIX_HORNY_KR = [
	// Korean
	"흥분", "잘서는", "쉬운 발기", "민감", "단단한", "거기가 단단" 
];

//+25% Strength, +25% Dexterity, +25% Endurance, -25% Agility, +35% Stamina, +50% Energy, +50% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_BIG_KR = [
	// Korean
	"덩치", "왕자지", "왕불알", "어깨", "정액탱크", "거근", "노애의 후예" 
];

//Starts the battle with the Angry state
const ENEMY_PREFIX_ANGRY_KR = [
	// Korean
	"화난", "화쟁이", "울컥쟁이", "격노", "성질급한", "짜증쟁이" 
];

//Metal
const ENEMY_PREFIX_METAL_KR = [
	"메탈", "강철의"
];

//+Talk lvl
const ENEMY_PREFIX_TALK_KR = [
	// Korean
	"수다쟁이", "달변가", "달변", "말많은", "침튀기는", "혀 긴", "떠벌떠벌" 
];

//+Sight lvl
const ENEMY_PREFIX_SIGHT_KR = [
	// Korean
	"힘준눈", "시력몰빵", "힐끔대는", "쳐다보는", "엿보기꾼", "도촬범", "시찰꾼" 
];

//+Maso lvl, +25% Stamina, +25% Energy
const ENEMY_PREFIX_MASO_KR = [
	// Korean
	"마조히스트", "마조", "마조변태", "수", "빨간엉덩이" 
];

//+Sado lvl, +10% Strength, +10% Dexterity, +10% Agility
const ENEMY_PREFIX_SADO_KR = [
	// Korean
	"새디스트", "새드", "새드변태", "공", "채찍" 
];

//No effect
const ENEMY_PREFIX_NEUTRAL_KR = [
	// Korean
	"평범한", "남들만큼", "몰개성", "무개성", "서민적", "평범", "렙업용", "하루살이" 
];
