const ENEMY_NAMES_GENERIC_RU = makeRussianNames([
	// English
	["Джордж", "Джорджа", "Джорджу", "Джорджа", "Джорджом", "Джордже"],
	["Джек", "Джека", "Джеку", "Джека", "Джеком", "Джеке"],
	["Ден", "Дена", "Дену", "Дена", "Деном", "Дене"],
	["Кристиан", "Кристиана", "Кристиану", "Кристиана", "Кристианом", "Кристиане"],
	["Алекс", "Алексы", "Алексу", "Алекса", "Алексом", "Алексе"],
	["Эрл", "Эрла", "Эрлу", "Эрла", "Эрлом", "Эрле"],
	["Томас", "Томаса", "Томасу", "Томаса", "Томасом", "Томасе"],
	["Роберт", "Роберта", "Роберту", "Роберта", "Робертом", "Роберте"],
	["Джейден", "Джейдена", "Джейдену", "Джейдена", "Джейденом", "Джейдене"],
	["Шон", "Шона", "Шону", "Шона", "Шоном", "Шоне"],
	["Джимми", "Джимми", "Джимми", "Джимми", "Джимми", "Джимми"],
	["Боб", "Боба", "Бобу", "Боба", "Бобом", "Бобе"],
	["Барри", "Барри", "Барри", "Барри", "Барри", "Барри"],
	["Брок", "Брока", "Броку", "Брока", "Броком", "Броке"],
	["Ангус", "Ангуса", "Ангусу", "Ангуса", "Ангусом", "Ангусе"],
	["Лукас", "Лукаса", "Лукасу", "Лукаса", "Лукасом", "Лукасе"],
	["Филипп", "Филиппа", "Филиппу", "Филиппа", "Филиппом", "Филиппе"],
	["Луис", "Луиса", "Луису", "Луиса", "Луисом", "Луисе"],
	["Рамон", "Рамона", "Рамону", "Рамона", "Рамоном", "Рамоне"],
	["Эш", "Эша", "Эшу", "Эша", "Эшом", "Эше"],
	["Сол", "Сола", "Солу", "Сола", "Солом", "Соле"],
	["Бэн", "Бэна", "Бэну", "Бэна", "Бэном", "Бэне"],
	["Николас", "Николаса", "Николасу", "Николаса", "Николасом", "Николасе"],
	["Питер", "Питера", "Питеру", "Питера", "Питером", "Питере"],
	["Джейсон", "Джейсона", "Джейсону", "Джейсона", "Джейсоном", "Джейсоне"],
	["Джуно", "Джуно", "Джуно", "Джуно", "Джуно", "Джуно"],
	["Пол", "Пола", "Полу", "Пола", "Полом", "Поле"],
	["Омар", "Омара", "Омару", "Омара", "Омаром", "Омаре"],
	["Эллиот", "Эллиота", "Эллиоту", "Эллиота", "Эллиотом", "Эллиоте"],
	["Ренди", "Ренди", "Ренди", "Ренди", "Ренди", "Ренди"],
	["Ланс", "Ланса", "Лансу", "Ланса", "Лансом", "Лансе"],
	["Стоун", "Стоуна", "Стоуну", "Стоуна", "Стоуном", "Стоуне"],
	["Терри", "Терри", "Терри", "Терри", "Терри", "Терри"],
	["Хайд", "Хайда", "Хайду", "Хайда", "Хайдом", "Хайде"],
	["Ленни", "Ленни", "Ленни", "Ленни", "Ленни", "Ленни"],
	["Маркус", "Маркуса", "Маркусу", "Маркуса", "Маркусом", "Маркусе"],
	["Дейв", "Дейва", "Дейву", "Дейва", "Дейвом", "Дейве"],
	["Каин", "Каина", "Каину", "Каина", "Каином", "Каине"],
	["Кристоф", "Кристофа", "Кристофу", "Кристофа", "Кристофом", "Кристофе"],
	// Japanese
	["Рен", "Рена", "Рену", "Рена", "Реном", "Рене"],
	["Рей", "Рея", "Рею", "Рея", "Реем", "Рее"],
	["Сатоши", "Сатоши", "Сатоши", "Сатоши", "Сатоши", "Сатоши"],
	["Кей", "Кея", "Кею", "Кея", "Кеем", "Кее"],
	["Кай", "Кая", "Каю", "Кая", "Каем", "Кае"],
	["Дзин", "Дзина", "Дзину", "Дзина", "Дзином", "Дзине"],
	["Такаши", "Такаши", "Такаши", "Такаши", "Такаши", "Такаши"],
	["Ямазаки", "Ямазаки", "Ямазаки", "Ямазаки", "Ямазаки", "Ямазаки"],
	["Миязаки", "Миязаки", "Миязаки", "Миязаки", "Миязаки", "Миязаки"],
	["Кейта", "Кейты", "Кейте", "Кейту", "Кейтой", "Кейте"],
	["Кентаро", "Кентаро", "Кентаро", "Кентаро", "Кентаро", "Кентаро"],
	["Юи", "Юи", "Юи", "Юи", "Юи", "Юи"],
	["Акума", "Акумы", "Акуме", "Акуму", "Акумой", "Акуме"],
	// Other Asian
	["Ким", "Кима", "Киму", "Кима", "Кимом", "Киме"],
	["Санг", "Санга", "Сангу", "Санга", "Сангом", "Санге"],
	["Донг", "Донга", "Донгу", "Донга", "Донгом", "Донге"],
	["Минг", "Минга", "Мингу", "Минга", "Мингом", "Минге"],
	["Янг", "Янга", "Янгу", "Янга", "Янгом", "Янге"],
	["Сяо", "Сяо", "Сяо", "Сяо", "Сяо", "Сяо"],
	["Пенг", "Пенга", "Пенгу", "Пенга", "Пенгом", "Пенге"],
	["Чан", "Чана", "Чану", "Чана", "Чаном", "Чане"],
	["Ли", "Ли", "Ли", "Ли", "Ли", "Ли"],
	["Сан", "Сана", "Сану", "Сана", "Саном", "Сане"],
	["Ксин", "Ксина", "Ксину", "Ксина", "Ксином", "Ксине"],
	// Slavic
	// common forms of names
	["Костя", "Кости", "Косте", "Костю", "Костей", "Косте"],
	["Никита", "Никиты", "Никите", "Никиту", "Никитой", "Никите"],
	["Егор", "Егора", "Егору", "Егора", "Егором", "Егоре"],
	["Макс", "Макса", "Максу", "Макса", "Максом", "Максе"],
	["Витя", "Вити", "Вите", "Витю", "Витей", "Вите"],
	["Борис", "Бориса", "Борису", "Бориса", "Борисом", "Борисе"],
	["Олег", "Олега", "Олегу", "Олега", "Олегом", "Олеге"],
	["Паша", "Паши", "Паше", "Пашу", "Пашей", "Паше"],
	// Other
	["Азамат", "Азамата", "Азамату", "Азамата", "Азаматом", "Азамате"],
	["Соломон", "Соломона", "Соломону", "Соломона", "Соломоном", "Соломоне"],
	["Нассим", "Нассима", "Нассиму", "Нассима", "Нассимом", "Нассиме"],
	["Али", "Али", "Али", "Али", "Али", "Али"],
]);

const ENEMY_NAMES_THUG_RU = makeRussianNames([
	// English
	["Крейн", "Крейна", "Крейну", "Крейна", "Крейном", "Крейне"],
	["Крейг", "Крейга", "Крейгу", "Крейга", "Крейгом", "Крейге"],
	["Томми", "Томми", "Томми", "Томми", "Томми", "Томми"],
	["Диего", "Диего", "Диего", "Диего", "Диего", "Диего"],
	["Джонсон", "Джонсона", "Джонсону", "Джонсона", "Джонсоном", "Джонсоне"],
	["Карл", "Карла", "Карлу", "Карла", "Карлом", "Карле"],
	["Ларри", "Ларри", "Ларри", "Ларри", "Ларри", "Ларри"],
	["Джонни", "Джонни", "Джонни", "Джонни", "Джонни", "Джонни"],
	["Нико", "Нико", "Нико", "Нико", "Нико", "Нико"],
	["Марко", "Марко", "Марко", "Марко", "Марко", "Марко"],
	["Дик", "Дика", "Дику", "Дика", "Диком", "Дике"],
	["Дюк", "Дюка", "Дюку", "Дюка", "Дюком", "Дюке"],
	["Люк", "Люка", "Люку", "Люка", "Люком", "Люке"],
	["Тревор", "Тревора", "Тревору", "Тревора", "Тревором", "Треворе"],
	["Франклин", "Франклина", "Франклину", "Франклина", "Франклином", "Франклине"],
	// Slavic
	// respectful forms of names
	["Александр", "Александра", "Александру", "Александра", "Александром", "Александре"],
	["Анатолий", "Анатолия", "Анатолию", "Анатолия", "Анатолием", "Анатолие"],
	["Влад", "Влада", "Владу", "Влада", "Владом", "Владе"],
	["Владимир", "Владимира", "Владимиру", "Владимира", "Владимиром", "Владимире"],
	["Михаил", "Михаила", "Михаилу", "Михаила", "Михаилом", "Михаиле"],
	["Борис", "Бориса", "Борису", "Бориса", "Борисом", "Борисе"],
	["Виктор", "Виктора", "Виктору", "Виктора", "Виктором", "Викторе"],
	["Марк", "Марка", "Марку", "Марка", "Марком", "Марке"],
	["Игорь", "Игоря", "Игорю", "Игоря", "Игорем", "Игоре"],
	["Иван", "Ивана", "Ивану", "Ивана", "Иваном", "Иване"],
	["Николай", "Николая", "Николаю", "Николая", "Николаем", "Николае"],
	["Олег", "Олега", "Олегу", "Олега", "Олегом", "Олеге"],
	["Павел", "Павла", "Павлу", "Павла", "Павлом", "Павле"],
	["Роман", "Романа", "Роману", "Романа", "Романом", "Романе"],
	["Руслан", "Руслана", "Руслану", "Руслана", "Русланом", "Руслан"],
	["Сергей", "Сергея", "Сергею", "Сергея", "Сергеем", "Сергее"],
	["Тарас", "Тараса", "Тарасу", "Тараса", "Тарасом", "Тарасе"],
	["Тимур", "Тимура", "Тимуру", "Тимура", "Тимуром", "Тимуре"],
	["Фёдор", "Фёдора", "Фёдору", "Фёдора", "Фёдором", "Фёдоре"],
]);

const ENEMY_NAMES_GOBLIN_RU = makeRussianNames([
	// Based on english version
	// Only names with some endings left for styling
	["Дринк", "Дринка", "Дринку", "Дринка", "Дринком", "Дринке"],
	["Срик", "Срика", "Срику", "Срика", "Сриком", "Срике"],
	["Прик", "Прика", "Прику", "Прика", "Приком", "Прике"],
	["Кильк", "Килька", "Кильку", "Килька", "Кильком", "Кильке"],
	["Томрик", "Томрика", "Томрику", "Томрика", "Томриком", "Томрике"],
	["Плек", "Плека", "Плеку", "Плека", "Плеком", "Плеке"],
	["Гоз", "Гоза", "Гозу", "Гоза", "Гозом", "Гозе"],
	["Гриз", "Гриза", "Гризу", "Гриза", "Гризом", "Гризе"],
	["Зурз", "Зурза", "Зурзу", "Зурза", "Зурзом", "Зурзе"],
	["Пиз", "Пиза", "Пизу", "Пиза", "Пизом", "Пизе"],
	["Йодз", "Йодза", "Йодзу", "Йодза", "Йодзом", "Йодзе"],
	["Бриз-Криз", "Бриз-Криза", "Бриз-Кризу", "Бриз-Криза", "Бриз-Кризом", "Бриз-Кризе"],
	["Физ-Биз", "Физ-Биза", "Физ-Бизу", "Физ-Биза", "Физ-Бизом", "Физ-Бизе"],
	["Уркс-Тульз", "Уркс-Тульза", "Уркс-Тульзу", "Уркс-Тульза", "Уркс-Тульзом", "Уркс-Тульзе"],
	["Таг", "Тага", "Тагу", "Тага", "Тагом", "Таге"],
	["Унг", "Унга", "Унгу", "Унга", "Унгом", "Унге"],
	["Зюг", "Зюга", "Зюгу", "Зюга", "Зюгом", "Зюге"],
	["Иг-Уг", "Иг-Уга", "Иг-Угу", "Иг-Уга", "Иг-Угом", "Иг-Уге"],
	["Зик-Бик", "Зик-Бика", "Зик-Бику", "Зик-Бика", "Зик-Биком", "Зик-Бике"],
	["Грем-Лин", "Грем-Лина", "Грем-Лину", "Грем-Лина", "Грем-Лином", "Грем-Лине"],
	["Гоб", "Гоба", "Гобу", "Гоба", "Гобом", "Гобе"],
]);

const ENEMY_NAMES_NERD_RU = makeRussianNames([
	// English
	["Карл", "Карла", "Карлу", "Карла", "Карлом", "Карле"],
	["Тимми", "Тимми", "Тимми", "Тимми", "Тимми", "Тимми"],
	["Джимми", "Джимми", "Джимми", "Джимми", "Джимми", "Джимми"],
	["Шелдон", "Шелдона", "Шелдону", "Шелдона", "Шелдоном", "Шелдоне"],
	["Гарри", "Гарри", "Гарри", "Гарри", "Гарри", "Гарри"],
	["Ник", "Ника", "Нику", "Ника", "Ником", "Нике"],
	// Slavic
	// Familiar forms of names
	["Сашка", "Сашки", "Сашке", "Сашку", "Сашкой", "Сашке"],
	["Толик", "Толика", "Толику", "Толика", "Толиком", "Толике"],
	["Владик", "Владика", "Владику", "Владика", "Владиком", "Владике"],
	["Вовка", "Вовки", "Вовке", "Вовку", "Вовкой", "Вовке"],
	["Мишаня", "Мишани", "Мишане", "Мишаню", "Мишаней", "Мишане"],
	["Борька", "Борьки", "Борьке", "Борьку", "Борькой", "Борьке"],
	["Витька", "Витьки", "Витьке", "Витьку", "Витькой", "Витьке"],
	["Ванька", "Ваньки", "Ваньке", "Ваньку", "Ванокой", "Ваньке"],
	["Колька", "Кольки", "Кольке", "Кольку", "Колькой", "Кольке"],
	["Пашка", "Пашки", "Пашке", "Пашку", "Пашкой", "Пашке"],
	["Ромка", "Ромки", "Ромке", "Ромку", "Ромкой", "Ромке"],
	["Серёжка", "Серёжки", "Серёжке", "Серёжку", "Серёжкой", "Серёжке"],
	["Федька", "Федьки", "Федьке", "Федку", "Федькой", "Федьке"],
]);

const ENEMY_NAMES_ROGUE_RU = makeRussianNames([
	// English
	["Рейнольд", "Рейнольда", "Рейнольду", "Рейнольда", "Рейнольдом", "Рейнольде"],
	["Виспер", "Виспера", "Висперу", "Виспера", "Виспером", "Виспере"],
	["Вейд", "Вейда", "Вейду", "Вейда", "Вейдом", "Вейде"],
	["Коннор", "Коннора", "Коннору", "Коннора", "Коннором", "Конноре"],
	["Джекс", "Джекса", "Джексу", "Джекса", "Джексом", "Джексе"],
	["Уилсон", "Уилсона", "Уилсону", "Уилсона", "Уилсоном", "Уилсоне"],
	["Хайден", "Хайдена", "Хайдену", "Хайдена", "Хайденом", "Хайдене"],
	["Кенни", "Кенни", "Кенни", "Кенни", "Кенни", "Кенни"],
	["Юта", "Юты", "Юте", "Юту", "Ютой", "Юте"],
	// Japanese
	["Ханзо", "Ханзо", "Ханзо", "Ханзо", "Ханзо", "Ханзо"],
	["Данзо", "Данзо", "Данзо", "Данзо", "Данзо", "Данзо"],
	["Кирин", "Кирин", "Кирин", "Кирин", "Кирин", "Кирин"],
	["Накамура", "Накамуры", "Накамуре", "Накамуру", "Накамурой", "Накамуре"],
	// Other Asian
	["Ли", "Ли", "Ли", "Ли", "Ли", "Ли"],
	// There are no typical names for rouges in Russian
]);

const ENEMY_NAMES_HOMELESS_RU = makeRussianNames([
	// English
	["Боб", "Боба", "Бобу", "Боба", "Бобом", "Бобе"],
	["Гарри", "Гарри", "Гарри", "Гарри", "Гарри", "Гарри"],
	["Брюс", "Брюса", "Брюсу", "Брюса", "Брюсом", "Брюсе"],
	["Роджер", "Роджера", "Роджеру", "Роджера", "Роджером", "Роджере"],
	["Грег", "Грега", "Грегу", "Грега", "Грегом", "Греге"],
	["Джеймс", "Джеймса", "Джеймсу", "Джеймса", "Джеймсом", "Джеймсе"],
	["Роберт", "Роберта", "Роберту", "Роберта", "Робертом", "Роберте"],
	["Рик", "Рика", "Рику", "Рика", "Риком", "Рике"],
	["Дэвид", "Дэвида", "Дэвиду", "Дэвида", "Дэвидом", "Дэвиде"],
	["Луис", "Луиса", "Луису", "Луиса", "Луисом", "Луисе"],
	["Рональд", "Рональда", "Рональду", "Рональда", "Рональдом", "Рональде"],
	["Хэнк", "Хэнка", "Хэнку", "Хэнка", "Хэнком", "Хэнке"],
	// Slavic
	// Familiar forms of patronymics, for styling
	["Саныч", "Саныча", "Санычу", "Саныча", "Санычем", "Саныче"],
	["Василич", "Василича", "Василичу", "Василича", "Василичем", "Василиче"],
	["Дмитрич", "Дмитрича", "Дмитричу", "Дмитрича", "Дмитричем", "Дмитриче"],
	["Михалыч", "Михалыча", "Михалычу", "Михалыча", "Михалычем", "Михалыче"],
	["Борисыч", "Борисыча", "Борисычу", "Борисыча", "Борисычем", "Борисыче"],
	["Иваныч", "Иваныча", "Иванычу", "Иваныча", "Иванычем", "Иваныче"],
	["Николаич", "Николаича", "Николаичу", "Николаича", "Николаичем", "Николаиче"],
	["Макарыч", "Макарыча", "Макарычу", "Макарыча", "Макарычем", "Макарыче"],
	["Ильич", "Ильича", "Ильичу", "Ильича", "Ильичем", "Ильиче"],
	["Палыч", "Палыча", "Палычу", "Палыча", "Палычем", "Палыче"],
	["Романыч", "Романыча", "Романычу", "Романыча", "Романычем", "Романыче"],
	["Сергеич", "Сергеича", "Сергеичу", "Сергеича", "Сергеичем", "Сергеиче"],
]);

const ENEMY_NAMES_LIZARDMAN_RU = makeRussianNames([
	// Based on english version
	// Only short names to make the lizardman name set unique (with a few exceptions)
	["Игги", "Игги", "Игги", "Игги", "Игги", "Игги"],
	["Загги", "Загги", "Загги", "Загги", "Загги", "Загги"],
	["Бригги", "Бригги", "Бригги", "Бригги", "Бригги", "Бригги"],
	["Закки", "Закки", "Закки", "Закки", "Закки", "Закки"],
	["Зикки", "Зикки", "Зикки", "Зикки", "Зикки", "Зикки"],
	["Ликки", "Ликки", "Ликки", "Ликки", "Ликки", "Ликки"],
	["Люкки", "Люкки", "Люкки", "Люкки", "Люкки", "Люкки"],
	["Шакки", "Шакки", "Шакки", "Шакки", "Шакки", "Шакки"],
	["Рикки", "Рикки", "Рикки", "Рикки", "Рикки", "Рикки"],
	["Джекки", "Джекки", "Джекки", "Джекки", "Джекки", "Джекки"],
	["Катсуки", "Катсуки", "Катсуки", "Катсуки", "Катсуки", "Катсуки"],
	["Слиппи", "Слиппи", "Слиппи", "Слиппи", "Слиппи", "Слиппи"],
	["Салли", "Салли", "Салли", "Салли", "Салли", "Салли"],
	["Джеффри", "Джеффри", "Джеффри", "Джеффри", "Джеффри", "Джеффри"],
	["Эдди", "Эдди", "Эдди", "Эдди", "Эдди", "Эдди"],
	["Кабо", "Кабо", "Кабо", "Кабо", "Кабо", "Кабо"],
	["Стенли", "Стенли", "Стенли", "Стенли", "Стенли", "Стенли"],
	["Амиго", "Амиго", "Амиго", "Амиго", "Амиго", "Амиго"],
	["Комодо", "Комодо", "Комодо", "Комодо", "Комодо", "Комодо"],
	["Абиру", "Абиру", "Абиру", "Абиру", "Абиру", "Абиру"],
	["Габиру", "Габиру", "Габиру", "Габиру", "Габиру", "Габиру"],
	["Пере", "Пере", "Пере", "Пере", "Пере", "Пере"],
	["Кен", "Кена", "Кену", "Кена", "Кеном", "Кене"],
	["Бэн", "Бэна", "Бэну", "Бэна", "Бэном", "Бэне"],
	["Дэн", "Дэна", "Дэну", "Дэна", "Дэном", "Дэне"],
	["Чун", "Чуна", "Чуну", "Чуна", "Чуном", "Чуне"],
	["Гон", "Гона", "Гону", "Гона", "Гоном", "Гоне"],
	["Никс", "Никса", "Никсу", "Никса", "Никсом", "Никсе"],
	["Эш", "Эша", "Эшу", "Эша", "Эшом", "Эше"],
	["Саша", "Саши", "Саше", "Сашу", "Сашой", "Саше"],
	["Зача", "Зачи", "Заче", "Зачу", "Зачей", "Заче"],
	["Шип", "Шипа", "Шипу", "Шипа", "Шипом", "Шипе"],
	["Шейп", "Шейпа", "Шейпу", "Шейпа", "Шейпом", "Шейпе"],
	["Ральф", "Ральфа", "Ральфу", "Ральфа", "Ральфом", "Ральфе"],
	["Альбин", "Альбина", "Альбину", "Альбина", "Альбином", "Альбине"],
	["Долан", "Долана", "Долану", "Долана", "Доланом", "Долане"],
	["Аргон", "Аргона", "Аргону", "Аргона", "Аргоном", "Аргоне"],
	["Зард", "Зарда", "Зарду", "Зарда", "Зардом", "Зарде"],
	["Крок", "Крока", "Кроку", "Крока", "Кроком", "Кроке"],
	["Л'Зард", "Л'Зарда", "Л'Зарду", "Л'Зарда", "Л'Зардом", "Л'Зарде"],
	["В'Зард", "В'Зарда", "В'Зарду", "В'Зарда", "В'Зардом", "В'Зарде"],
	["Джари'Ра", "Джари'Ры", "Джари'Ре", "Джари'Ру", "Джари'Рой", "Джари'Ре"],
]);

const ENEMY_NAMES_ORC_RU = makeRussianNames([
	// Based on english version
	// Only names with some endings left for styling
	["Гронк", "Гронка", "Гронку", "Гронка", "Гронком", "Гронке"],
	["Квак", "Квака", "Кваку", "Квака", "Кваком", "Кваке"],
	["Букбук", "Букбука", "Букбуку", "Букбука", "Букбуком", "Букбуке"],
	["Морк", "Морка", "Морку", "Морка", "Морком", "Морке"],
	["Скурк", "Скурка", "Скурку", "Скурка", "Скурком", "Скурке"],
	["Грогнак", "Грогнака", "Грогнаку", "Грогнака", "Грогнаком", "Грогнаке"],
	["Горок", "Горока", "Гороку", "Горока", "Гороком", "Гороке"],
	["Лурдик", "Лурдика", "Лурдику", "Лурдика", "Лурдиком", "Лурдике"],
	["Бремак", "Бремака", "Бремаку", "Бремака", "Бремаком", "Бремаке"],
	["Гранок", "Гранока", "Граноку", "Гранока", "Граноком", "Граноке"],
	["Порк", "Порка", "Порку", "Порка", "Порком", "Порке"],
	["Чунк", "Чунка", "Чунку", "Чунка", "Чунком", "Чунке"],
	["Тук", "Тука", "Туку", "Тука", "Туком", "Туке"],
	["Кок", "Кока", "Коку", "Кока", "Коком", "Коке"],
	["Хранк", "Хранка", "Хранку", "Хранка", "Хранком", "Хранке"],
	["Бибинк", "Бибинка", "Бибинку", "Бибинка", "Бибинком", "Бибинке"],
	["Манкирк", "Манкирка", "Манкирку", "Манкирка", "Манкирком", "Манкирке"],
	["Янг", "Янга", "Янгу", "Янга", "Янгом", "Янге"],
	["Пог", "Пога", "Погу", "Пога", "Погом", "Поге"],
	["Пиг", "Пига", "Пигу", "Пига", "Пигом", "Пиге"],
	["Ророг", "Ророга", "Ророгу", "Ророга", "Ророгом", "Ророге"],
	["Лианг", "Лианга", "Лиангу", "Лианга", "Лиангом", "Лианге"],
	["Харг", "Харга", "Харгу", "Харга", "Харгом", "Харге"],
	["Хрюнг", "Хрюнга", "Хрюнгу", "Хрюнга", "Хрюнгом", "Хрюнге"],
	["Зугзуг", "Зугзуга", "Зугзугу", "Зугзуга", "Зугзугом", "Зугзуге"],
	["Снуг Снуг", "Снуг Снуга", "Снуг Снугу", "Снуг Снуга", "Снуг Снугом", "Снуг Снуге"],
	["Вульфганг", "Вульфганга", "Вульфгангу", "Вульфганга", "Вульфгангом", "Вульфганге"],
	["Нетор'арок", "Нетор'арока", "Нетор'ароку", "Нетор'арока", "Нетор'ароком", "Нетор'ароке"],
	["Брут", "Брута", "Бруту", "Брута", "Брутом", "Бруте"],
	["Грюнт", "Грюнта", "Грюнту", "Грюнта", "Грюнтом", "Грюнте"],
	["Каррот", "Каррота", "Карроту", "Каррота", "Карротом", "Карроте"],
	["Харт", "Харта", "Харту", "Харта", "Хартом", "Харте"],
	["Алард", "Аларда", "Аларду", "Аларда", "Алардом", "Аларде"],
	["Ротад", "Ротада", "Ротаду", "Ротада", "Ротадом", "Ротаде"],
	["Гонад", "Гонада", "Гонаду", "Гонада", "Гонадом", "Гонаде"],
	["Хигард", "Хигарда", "Хигарду", "Хигарда", "Хигардом", "Хигарде"],
	["Грегор", "Грегора", "Грегору", "Грегора", "Грегором", "Грегоре"],
	["Гронар", "Гронара", "Гронару", "Гронара", "Гронаром", "Гронаре"],
	["Брух", "Бруха", "Бруху", "Бруха", "Брухом", "Брухе"],
	["Пипо", "Пипо", "Пипо", "Пипо", "Пипо", "Пипо"],
]);

const ENEMY_NAMES_WEREWOLF_RU = makeRussianNames([
	// common dog names
	["Бобик", "Бобика", "Бобику", "Бобика", "Бобиком", "Бобике"],
	["Шарик", "Шарика", "Шарику", "Шарика", "Шариком", "Шарике"],
	["Барбос", "Барбоса", "Барбосу", "Барбоса", "Барбосом", "Барбосе"],
	["Малыш", "Малыша", "Малышу", "Малыша", "Малышом", "Малыше"],
	["Рекс", "Рекса", "Рексу", "Рекса", "Рексом", "Рексе"],
	["Жорик", "Жорика", "Жорику", "Жорика", "Жориком", "Жорике"],
	["Фунтик", "Фунтика", "Фунтику", "Фунтика", "Фунтиком", "Фунтике"],
	["Флайт", "Флайта", "Флайту", "Флайта", "Флайтом", "Флайте"],
	["Пират", "Пирата", "Пирату", "Пирата", "Пиратом", "Пирате"],
	["Барон", "Барона", "Барону", "Барона", "Бароном", "Бароне"],
	["Цезарь", "Цезаря", "Цезарю", "Цезаря", "Цезарем", "Цезаре"],
	["Мухтар", "Мухтара", "Мухтару", "Мухтара", "Мухтаром", "Мухтаре"],
	["Полкан", "Полкана", "Полкану", "Полкана", "Полканом", "Полкане"],
	["Джерри", "Джерри", "Джерри", "Джерри", "Джерри", "Джерри"],
	["Брюс", "Брюса", "Брюсу", "Брюса", "Брюсом", "Брюсе"],
	["Атос", "Атоса", "Атосу", "Атоса", "Атосом", "Атосе"],
	["Дик", "Дика", "Дику", "Дика", "Диком", "Дике"],
	["Дюк", "Дюка", "Дюку", "Дюка", "Дюком", "Дюке"],
	["Люк", "Люка", "Люку", "Люка", "Люком", "Люке"],
	["Макс", "Макса", "Максу", "Макса", "Максом", "Максе"],
	["Хороший Мальчик", "Хорошего Мальчика", "Хорошему Мальчику", "Хорошего Мальчика", "Хорошим Мальчиком", "Хорошем Мальчике"],
	["Плохой Мальчик", "Плохого Мальчика", "Плохому Мальчику", "Плохого Мальчика", "Плохим Мальчиком", "Плохом Мальчике"],
]);

const ENEMY_NAMES_YETI_RU = makeRussianNames([
	// Based on english version
	// But added a little cute names
	["Танк", "Танка", "Танку", "Танка", "Танком", "Танке"],
	["Канг", "Канга", "Кангу", "Канга", "Кангом", "Канге"],
	["Конг", "Конга", "Конгу", "Конга", "Конгом", "Конге"],
	["Конг", "Конга", "Конгу", "Конга", "Конгом", "Конге"],
	["Конг", "Конга", "Конгу", "Конга", "Конгом", "Конге"],
	["Кинг", "Кинга", "Кингу", "Кинга", "Кингом", "Кинге"],
	["Кинг", "Кинга", "Кингу", "Кинга", "Кингом", "Кинге"],
	["Малыш", "Малыша", "Малышу", "Малыша", "Малышом", "Малыше"],
	["Сладкий", "Сладкого", "Сладкому", "Сладкого", "Сладким", "Сладком"],
	["Белый", "Белого", "Белому", "Белого", "Белым", "Белом"],
	["Беляш", "Беляша", "Беляшу", "Беляша", "Беляшом", "Беляше"],
	["Синий", "Синего", "Синему", "Синего", "Синим", "Синем"],
	["Эстер", "Эстера", "Эстеру", "Эстера", "Эстером", "Эстере"],
	["Джек", "Джека", "Джеку", "Джека", "Джеком", "Джеке"],
	["Икки", "Икки", "Икки", "Икки", "Икки", "Икки"],
	["Тини", "Тини", "Тини", "Тини", "Тини", "Тини"],
	["Бетти", "Бетти", "Бетти", "Бетти", "Бетти", "Бетти"],
	["Спагетти", "Спагетти", "Спагетти", "Спагетти", "Спагетти", "Спагетти"],
	["Йет", "Йета", "Йету", "Йета", "Йетом", "Йете"],
	["Йета", "Йеты", "Йете", "Йету", "Йетой", "Йете"],
	["Фурбол", "Фурбола", "Фурболу", "Фурбола", "Фурболом", "Фурболе"],
	["Примус", "Примуса", "Примусу", "Примуса", "Примусом", "Примусе"],
	["Пеллиус", "Пеллиуса", "Пеллиусу", "Пеллиуса", "Пеллиусом", "Пеллиусе"],
	["Бамбо", "Бамбо", "Бамбо", "Бамбо", "Бамбо", "Бамбо"],
	["Яма", "Ямы", "Яме", "Яму", "Ямой", "Яме"],
	["Туф", "Туфа", "Туфу", "Туфа", "Туфом", "Туфе"],
	["Пуф", "Пуфа", "Пуфу", "Пуфа", "Пуфом", "Пуфе"],
	["Нуну", "Нуну", "Нуну", "Нуну", "Нуну", "Нуну"],
	["Бобо", "Бобо", "Бобо", "Бобо", "Бобо", "Бобо"],
	["Фу", "Фу", "Фу", "Фу", "Фу", "Фу"],
	["Милоло", "Милоло", "Милоло", "Милоло", "Милоло", "Милоло"],
	["Ренато", "Ренато", "Ренато", "Ренато", "Ренато", "Ренато"],
	["Арнольдо", "Арнольдо", "Арнольдо", "Арнольдо", "Арнольдо", "Арнольдо"],
	["Купу", "Купу", "Купу", "Купу", "Купу", "Купу"],
	["Чаппу", "Чаппу", "Чаппу", "Чаппу", "Чаппу", "Чаппу"],
	["Энрико", "Энрико", "Энрико", "Энрико", "Энрико", "Энрико"],
	["Флаффи", "Флаффи", "Флаффи", "Флаффи", "Флаффи", "Флаффи"],
	["Зуки", "Зуки", "Зуки", "Зуки", "Зуки", "Зуки"],
	["Лики", "Лики", "Лики", "Лики", "Лики", "Лики"],
	["Нейдзи", "Нейдзи", "Нейдзи", "Нейдзи", "Нейдзи", "Нейдзи"],
	["Тораси", "Тораси", "Тораси", "Тораси", "Тораси", "Тораси"],
	["Кемиру", "Кемиру", "Кемиру", "Кемиру", "Кемиру", "Кемиру"],
	["Би", "Би", "Би", "Би", "Би", "Би"],
	["Терри", "Терри", "Терри", "Терри", "Терри", "Терри"],
	["Тамали", "Тамали", "Тамали", "Тамали", "Тамали", "Тамали"],
	["Хардо", "Хардо", "Хардо", "Хардо", "Хардо", "Хардо"],
	["Геродо", "Геродо", "Геродо", "Геродо", "Геродо", "Геродо"],
	["Айси", "Айси", "Айси", "Айси", "Айси", "Айси"],
	["Фрости", "Фрости", "Фрости", "Фрости", "Фрости", "Фрости"],
	["Диг", "Дига", "Дигу", "Дига", "Дигом", "Диге"],
	["Тим", "Тима", "Тиму", "Тима", "Тимом", "Тиме"],
	["Лунк", "Лунка", "Лунку", "Лунка", "Лунком", "Лунке"],
	["Салливан", "Салливана", "Салливану", "Салливана", "Салливаном", "Салливане"],
	["Райли", "Райли", "Райли", "Райли", "Райли", "Райли"],
	["Джаттер", "Джаттера", "Джаттеру", "Джаттера", "Джаттером", "Джаттере"],
	["Болгор", "Болгора", "Болгору", "Болгора", "Болгором", "Болгоре"],
	["Гаргос", "Гаргоса", "Гаргосу", "Гаргоса", "Гаргосом", "Гаргосе"],
	["Вальдерот", "Вальдерота", "Вальдероту", "Вальдерота", "Вальдеротом", "Вальдероте"],
	["Грекк", "Грекка", "Грекку", "Грекка", "Грекком", "Грекке"],
	["Оран", "Орана", "Орану", "Орана", "Ораном", "Оране"],
	["Стивен", "Стивена", "Стивену", "Стивена", "Стивеном", "Стивене"],
	["Дарлинг", "Дарлинга", "Дарлингу", "Дарлинга", "Дарлингом", "Дарлинге"],
	["Кифа", "Кифы", "Кифе", "Кифу", "Кифой", "Кифе"],
	["Кронк", "Кронка", "Кронку", "Кронка", "Кронком", "Кронке"],
	["Дориан", "Дориана", "Дориану", "Дориана", "Дорианом", "Дориане"],
	["Шериф", "Шерифа", "Шерифу", "Шерифа", "Шерифом", "Шерифе"],
	["Бамба", "Бамбы", "Бамбе", "Бамбу", "Бамбой", "Бамбе"],
	["Дилан", "Дилана", "Дилану", "Дилана", "Диланом", "Дилане"],
	["Дилан", "Дилана", "Дилану", "Дилана", "Диланом", "Дилане"],
	["Геральд", "Геральда", "Геральду", "Геральда", "Геральдом", "Геральде"],
	["Пушистик", "Пушистика", "Пушистику", "Пушистика", "Пушистиком", "Пушистике"],
	["Мистер Бонго", "Мистера Бонго", "Мистеру Бонго", "Мистера Бонго", "Мистером Бонго", "Мистере Бонго"],
	["Большой Тако", "Большим Тако", "Большому Тако", "Большого Тако", "Большим Тако", "Большом Тако"],
	["Большая Рука", "Большой Руки", "Большой Руке", "Большую Руку", "Большой Рукой", "Большой Руке"],
	["Большая Нога", "Большой Ноги", "Большой Ноге", "Большую Ногу", "Большой Ногой", "Большой Ноге"],
]);

const ENEMY_NAMES_SLIME_RU = makeRussianNames([
	// Based on english version
	["Римуру", "Римуру", "Римуру", "Римуру", "Римуру", "Римуру"],
	["Жижа", "Жижи", "Жиже", "Жижу", "Жижой", "Жиже"],
	["Йогурт", "Йогурта", "Йогурту", "Йогурт", "Йогуртом", "Йогурте"],
	["Капля", "Капли", "Капле", "Каплю", "Каплей", "Капле"],
	["Кусок", "Куска", "Куску", "Куска", "Куском", "Куске"],
	["Джерри", "Джерри", "Джерри", "Джерри", "Джерри", "Джерри"],
	["Лайм", "Лайма", "Лайму", "Лайма", "Лаймом", "Лайме"],
	["Силикон", "Силикона", "Силикону", "Силикона", "Силиконом", "Силиконе"],
	["Кремень", "Кремня", "Кремню", "Кремня", "Кремнем", "Кремне"],
]);

const ENEMY_NAMES_VISITOR_MALE_RU = makeRussianNames([
	["Диего", "Диего", "Диего", "Диего", "Диего", "Диего"],
	["Джек", "Джека", "Джеку", "Джека", "Джеком", "Джеке"],
	["Винсент", "Винсента", "Винсенту", "Винсента", "Винсентом", "Винсенте"],
	["Трой", "Троя", "Трою", "Троя", "Троем", "Трое"],
	["Дональд", "Дональда", "Дональду", "Дональда", "Дональдом", "Дональде"],
	["Боб", "Боба", "Бобу", "Боба", "Бобом", "Бобе"],
	["Габен", "Габена", "Габену", "Габена", "Габеном", "Габене"],
	["Роланд", "Роланда", "Роланду", "Роланда", "Роландом", "Роланде"],
	["Феликс", "Феликса", "Феликсу", "Феликса", "Феликсом", "Феликсе"],
	["Макс", "Макса", "Максу", "Макса", "Максом", "Максе"],
	["Джонни", "Джонни", "Джонни", "Джонни", "Джонни", "Джонни"],
	["Ангус", "Ангуса", "Ангусу", "Ангуса", "Ангусом", "Ангусе"],
	["Грегорио", "Грегорио", "Грегорио", "Грегорио", "Грегорио", "Грегорио"],
	["Дофф", "Доффа", "Доффу", "Доффа", "Доффом", "Доффе"],
	["Микки", "Микки", "Микки", "Микки", "Микки", "Микки"],
	["Арнольдо", "Арнольдо", "Арнольдо", "Арнольдо", "Арнольдо", "Арнольдо"],
	["Харди", "Харди", "Харди", "Харди", "Харди", "Харди"],
	["Гарри", "Гарри", "Гарри", "Гарри", "Гарри", "Гарри"],
	["Скотт", "Скотта", "Скотту", "Скотта", "Скоттом", "Скотте"],
	["Дино", "Дино", "Дино", "Дино", "Дино", "Дино"],
	["Тайлер", "Тайлера", "Тайлеру", "Тайлера", "Тайлером", "Тайлере"],
	["Максимус", "Максимуса", "Максимусу", "Максимуса", "Максимусом", "Максимусе"],
	["Лебедев", "Лебедева", "Лебедеву", "Лебедева", "Лебедевым", "Лебедеве"],
	["Джей", "Джея", "Джею", "Джея", "Джеем", "Джее"],
]);

const ENEMY_NAMES_VISITOR_FEMALE_RU = makeRussianNames([
	["Лилли", "Лилли", "Лилли", "Лилли", "Лилли", "Лилли"],
	["Лилит", "Лилит", "Лилит", "Лилит", "Лилит", "Лилит"],
	["Аой", "Аой", "Аой", "Аой", "Аой", "Аой"],
	["Беатрис", "Беатрис", "Беатрис", "Беатрис", "Беатрис", "Беатрис"],
	["Дафна", "Дафны", "Дафне", "Дафну", "Дафной", "Дафне"],
	["Рита", "Риты", "Рите", "Риту", "Ритой", "Рите"],
	["Селина", "Селины", "Селине", "Селину", "Селиной", "Селине"],
	["Елена", "Елены", "Елене", "Елену", "Еленой", "Елене"],
	["Мария", "Марии", "Марие", "Марию", "Марией", "Марие"],
	["Ольга", "Ольги", "Ольге", "Ольгу", "Ольгой", "Ольге"],
	["Анна", "Анны", "Анне", "Анну", "Анной", "Анне"],
	["Надежда", "Надежды", "Надежде", "Надежду", "Надеждой", "Надежде"],
	["Кира", "Киры", "Кире", "Киру", "Кирой", "Кире"],
	["Лиза", "Лизы", "Лизе", "Лизу", "Лизой", "Лизе"],
	["Лола", "Лолы", "Лоле", "Лолу", "Лолой", "Лоле"],
	["Мая", "Маи", "Мае", "Маю", "Маей", "Мае"],
	["Мика", "Мики", "Мике", "Мику", "Микой", "Мике"],
	["Агата", "Агаты", "Агате", "Агату", "Агатой", "Агате"],
	["Зара", "Зары", "Заре", "Зару", "Зарой", "Заре"],
	["Анастасия", "Анастасии", "Анастасие", "Анастасию", "Анастасией", "Анастасие"],
]);

const ENEMY_NAMES_VISITOR_UNISEX_RU = makeRussianNames([
	["Квинн", "Квинн", "Квинн", "Квинн", "Квинн", "Квинн"],
	["Рин", "Рин", "Рин", "Рин", "Рин", "Рин"],
	["Саша", "Саши", "Саше", "Сашу", "Сашой", "Саше"],
]);

//-15% all stats
const ENEMY_PREFIX_BAD_RU = makeRussianNames([
	["Херовый", "Херового", "Херовому", "Херового", "Херовым", "Херовом"],
	["Хилый", "Хилого", "Хилому", "Хилого", "Хилым", "Хилом"],
	["Убогий", "Убогого", "Убогому", "Убогого", "Убогим", "Убогом"],
	["Мелкий", "Мелкого", "Мелкому", "Мелкого", "Мелким", "Мелком"],
	["Толстый", "Толстого", "Толстому", "Толстого", "Толстым", "Толстом"],
	["Жирный", "Жирного", "Жирному", "Жирного", "Жирным", "Жирном"],
	["Жиробас", "Жиробаса", "Жиробасу", "Жиробаса", "Жиробасом", "Жиробасе"],
	["Жиртрест", "Жиртреста", "Жиртресту", "Жиртреста", "Жиртрестом", "Жиртресте"],
	["Тупой", "Тупого", "Тупому", "Тупого", "Тупым", "Тупом"],
	["Тормоз", "Тормоза", "Тормозу", "Тормоза", "Тормозом", "Тормозе"],
	["Тощий", "Тощего", "Тощему", "Тощего", "Тощим", "Тощем"],
	["Дрыщ", "Дрыща", "Дрыщу", "Дрыща", "Дрыщом", "Дрыще"],
	["Щуплый", "Щуплого", "Щуплому", "Щуплого", "Щуплым", "Щуплом"],
	["Слабак", "Слабака", "Слабаку", "Слабака", "Слабаком", "Слабаке"],
	["Трус", "Труса", "Трусу", "Труса", "Трусом", "Трусе"],
	["Хромой", "Хромого", "Хромому", "Хромого", "Хромым", "Хромом"],
	["Косой", "Косого", "Косому", "Косого", "Косым", "Косом"],
	["Кривой", "Кривого", "Кривому", "Кривого", "Кривым", "Кривом"],
	["Отброс", "Отброса", "Отброс", "Отброса", "Отбросом", "Отбросе"],
]);
const ENEMY_PREFIX_DRUNK_RU = makeRussianNames([
	["Бухой", "Бухого", "Бухому", "Бухого", "Бухим", "Бухом"],
	["Бухой", "Бухого", "Бухому", "Бухого", "Бухим", "Бухом"],
	["Пьяный", "Пьяного", "Пьяному", "Пьяного", "Пьяным", "Пьяном"],
	["Пьяный", "Пьяного", "Пьяному", "Пьяного", "Пьяным", "Пьяном"],
	["Пьяный", "Пьяного", "Пьяному", "Пьяного", "Пьяным", "Пьяном"],
	["Синий", "Синего", "Синему", "Синего", "Синим", "Синего"],
	["Поддатый", "Поддатого", "Поддатому", "Поддатого", "Поддатым", "Поддатого"],
	["Ужратый", "Ужратого", "Ужратому", "Ужратого", "Ужратым", "Ужратого"],
]);
//-15% all stats, -1 ejaculation stock
const ENEMY_PREFIX_HUNGRY_RU = makeRussianNames([
	["Голодный", "Голодного", "Голодному", "Голодного", "Голодным", "Голодном"],
	["Тощий", "Тощего", "Тощему", "Тощего", "Тощим", "Тощем"],
]);
//-25% all stats, -1 ejaculation stock
const ENEMY_PREFIX_STARVING_RU = makeRussianNames([
	["Изголодавшийся", "Изголодавшегося", "Изголодавшемуся", "Изголодавшегося", "Изголодавшимся", "Изголодавшемся"],
	["Умирающий", "Умирающего", "Умирающему", "Умирающего", "Умирающим", "Умирающем"],
]);
//-25% Strength, -15% Stamina
const ENEMY_PREFIX_WEAK_RU = makeRussianNames([
	["Слабый", "Слабого", "Слабому", "Слабого", "Слабым", "Слабом"],
	["Слабак", "Слабака", "Слабаку", "Слабака", "Слабаком", "Слабаке"],
	["Дрыщ", "Дрыща", "Дрыщу", "Дрыща", "Дрыщом", "Дрыще"],
	["Хрупкий", "Хрупкого", "Хрупкому", "Хрупкого", "Хрупким", "Хрупком"],
	["Мягкий", "Мягкого", "Мягкому", "Мягкого", "Мягким", "Мягком"],
	["Хилый", "Хилого", "Хилому", "Хилого", "Хилым", "Хилом"],
]);
//-25% Dexterity, -10% Energy
const ENEMY_PREFIX_INEPT_RU = makeRussianNames([
	["Неуклюжий", "Неуклюжего", "Неуклюжему", "Неуклюжего", "Неуклюжим", "Неуклюжем"],
	["Неумелый", "Неумелого", "Неумелому", "Неумелого", "Неумелым", "Неумелом"],
	["Неопытный", "Неопытного", "Неопытному", "Неопытного", "Неопытным", "Неопытном"],
	["Мелкий", "Мелкого", "Мелкому", "Мелкого", "Мелким", "Мелком"],
	["Импотент", "Импотента", "Импотенту", "Импотента", "Импотентом", "Импотенте"],
	["Нерабочий", "Нерабочего", "Нерабочему", "Нерабочего", "Нерабочим", "Нерабочем"],
	["Жирный", "Жирного", "Жирному", "Жирного", "Жирным", "Жирном"],
]);
//-25% Agility
const ENEMY_PREFIX_SLOW_RU = makeRussianNames([
	["Медлительный", "Медлительного", "Медлительному", "Медлительного", "Медлительным", "Медлительном"],
	["Толстый", "Толстого", "Толстому", "Толстого", "Толстым", "Толстом"],
	["Спящий", "Спящего", "Спящему", "Спящего", "Спящим", "Спящем"],
	["Сонный", "Сонного", "Сонному", "Сонного", "Сонным", "Сонном"],
	["Хромой", "Хромого", "Хромому", "Хромого", "Хромым", "Хромом"],
]);
//-25% Endurance, -10% Stamina, -15% Energy, -1 ejaculation stock
const ENEMY_PREFIX_SENSITIVE_RU = makeRussianNames([
	["Чувствительный", "Чувствительного", "Чувствительному", "Чувствительного", "Чувствительным", "Чувствительном"],
	["Преждевременный", "Преждевременного", "Преждевременному", "Преждевременного", "Преждевременным", "Преждевременном"],
	["Скорострел", "Скорострела", "Скорострелу", "Скорострела", "Скорострелом", "Скоростреле"],
	["Быстрый", "Быстрого", "Быстрому", "Быстрого", "Быстрым", "Быстром"],
	["Экспресс", "Экспресса", "Экспрессу", "Экспресс", "Экспрессом", "Экспрессе"],
]);

//+15% All Stats, +25% Stamina, +15% Ejaculation Volume
const ENEMY_PREFIX_GOOD_RU = makeRussianNames([
	["Сильный", "Сильного", "Сильному", "Сильного", "Сильным", "Сильном"],
	["Умелый", "Умелого", "Умелому", "Умелого", "Умелым", "Умелом"],
	["Коварный", "Коварного", "Коварному", "Коварного", "Коварным", "Коварном"],
	["Мужественный", "Мужественного", "Мужественному", "Мужественного", "Мужественным", "Мужественном"],
	["Красивый", "Красивого", "Красивому", "Красивого", "Красивым", "Красивом"],
	["Отважный", "Отважного", "Отважному", "Отважного", "Отважным", "Отважном"],
	["Храбрый", "Храброго", "Храброму", "Храброго", "Храбрым", "Храбром"],
	["Опытный", "Опытного", "Опытному", "Опытного", "Опытным", "Опытном"],
	["Большой", "Большого", "Большому", "Большого", "Большим", "Большом"],
	["Возбуждённый", "Возбуждённого", "Возбуждённому", "Возбуждённого", "Возбуждённым", "Возбуждённом"],
	["Жёсткий", "Жёсткого", "Жёсткому", "Жёсткого", "Жёстким", "Жёстком"],
	["Пылкий", "Пылкого", "Пылкому", "Пылкого", "Пылким", "Пылком"],
	["Горячий", "Горячего", "Горячему", "Горячего", "Горячим", "Горячем"],
	["Загадочный", "Загадочного", "Загадочному", "Загадочного", "Загадочным", "Загадочном"],
	["Умный", "Умного", "Умному", "Умного", "Умным", "Умном"],
	["Находчивый", "Находчивого", "Находчивому", "Находчивого", "Находчивым", "Находчивом"],
]);
//+30% All Stats, +35% Stamina, +50% Energy, +25% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_ELITE_RU = makeRussianNames([
	["Элитный", "Элитного", "Элитному", "Элитного", "Элитным", "Элитном"],
	["Ужасающий", "Ужасающего", "Ужасающему", "Ужасающего", "Ужасающим", "Ужасающем"],
	["Опасный", "Опасного", "Опасному", "Опасного", "Опасным", "Опасном"],
	["Извращённый", "Извращённого", "Извращённому", "Извращённого", "Извращённым", "Извращённом"],
	["Бесподобный", "Бесподобного", "Бесподобному", "Бесподобного", "Бесподобным", "Бесподобном"],
	["Невероятный", "Невероятного", "Невероятному", "Невероятного", "Невероятным", "Невероятном"],
	["Великий", "Великого", "Великому", "Великого", "Великим", "Великом"],
	["Доминатор", "Доминатора", "Доминатору", "Доминатора", "Доминатором", "Доминаторе"],
	["Всемогущий", "Всемогущего", "Всемогущему", "Всемогущего", "Всемогущим", "Всемогущем"],
]);
//+30% Strength, +15% Stamina
const ENEMY_PREFIX_STRONG_RU = makeRussianNames([
	["Сильный", "Сильного", "Сильному", "Сильного", "Сильным", "Сильном"],
	["Силач", "Силача", "Силачу", "Силача", "Силачём", "Силаче"],
	["Качёк", "Качка", "Качку", "Качка", "Качком", "Качке"],
	["Крепкий", "Крепкого", "Крепкому", "Крепкого", "Крепким", "Крепком"],
	["Крепыш", "Крепыша", "Крепышу", "Крепыша", "Крепышом", "Крепыше"],
]);
//+30% Dexterity, +10% Energy
const ENEMY_PREFIX_DEXTEROUS_RU = makeRussianNames([
	["Ловкий", "Ловкого", "Ловкому", "Ловкого", "Ловким", "Ловком"],
	["Коварный", "Коварного", "Коварному", "Коварного", "Коварным", "Коварном"],
	["Красивый", "Красивого", "Красивому", "Красивого", "Красивым", "Красивом"],
	["Умелый", "Умелого", "Умелому", "Умелого", "Умелым", "Умелом"],
	["Гибкий", "Гибкого", "Гибкому", "Гибкого", "Гибким", "Гибком"],
	["Опытный", "Опытного", "Опытному", "Опытного", "Опытным", "Опытном"],
	["Ловелас", "Ловеласа", "Ловеласу", "Ловеласа", "Ловеласом", "Ловеласе"],
	["Казанова", "Казановы", "Казанове", "Казанову", "Казановой", "Казанове"],
]);
//+30% Agility
const ENEMY_PREFIX_AGILE_RU = makeRussianNames([
	["Проворный", "Проворного", "Проворному", "Проворного", "Проворным", "Проворном"],
	["Быстрый", "Быстрого", "Быстрому", "Быстрого", "Быстрым", "Быстром"],
	["Стремительный", "Стремительного", "Стремительному", "Стремительного", "Стремительным", "Стремительном"],
]);
//+30% Endurance, +35% Stamina, +25% Energy, +25% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_ENDURING_RU = makeRussianNames([
	["Выносливый", "Выносливого", "Выносливому", "Выносливого", "Выносливым", "Выносливом"],
	["Стойкий", "Стойкого", "Стойкому", "Стойкого", "Стойким", "Стойком"],
	["Прочный", "Прочного", "Прочному", "Прочного", "Прочным", "Прочном"],
	["Жёсткий", "Жёсткого", "Жёсткому", "Жёсткого", "Жёстким", "Жёстком"],
	["Опытный", "Опытного", "Опытному", "Опытного", "Опытным", "Опытном"],
	["Большой", "Большого", "Большому", "Большого", "Большим", "Большом"],
	["Мужественный", "Мужественного", "Мужественному", "Мужественного", "Мужественным", "Мужественном"],
	["Живучий", "Живучего", "Живучему", "Живучего", "Живучим", "Живучем"],
]);

//-25% Dexterity, -25% Endurance, +50% Energy
//With passives: -50% Charm, +50% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_VIRGIN_RU = makeRussianNames([
	["Девственник", "Девственника", "Девственнику", "Девственника", "Девственником", "Девственнике"],
	["Девственник", "Девственника", "Девственнику", "Девственника", "Девственником", "Девственнике"],
	["Девственный", "Девственного", "Девственному", "Девственного", "Девственным", "Девственном"],
	["Непорочный", "Непорочного", "Непорочному", "Непорочного", "Непорочным", "Непорочном"],
]);

//+10% Strength, +10% Dexterity, +10% Agility, -50% Charm, Starts the battle with the Horny state
const ENEMY_PREFIX_HORNY_RU = makeRussianNames([
	["Возбуждённый", "Возбуждённого", "Возбуждённому", "Возбуждённого", "Возбуждённым", "Возбуждённом"],
	["Озабоченный", "Озабоченного", "Озабоченному", "Озабоченного", "Озабоченным", "Озабоченном"],
	["Извращенец", "Извращенца", "Извращенецу", "Извращенеца", "Извращенецем", "Извращенеце"],
]);

//+25% Strength, +25% Dexterity, +25% Endurance, -25% Agility, +35% Stamina, +50% Energy, +50% Ejaculation Volume, +1 ejaculation stock
const ENEMY_PREFIX_BIG_RU = makeRussianNames([
	["Большой", "Большого", "Большому", "Большого", "Большим", "Большом"],
	["Огромный", "Огромного", "Огромному", "Огромного", "Огромным", "Огромном"],
	["Гигант", "Гиганта", "Гиганту", "Гиганта", "Гигантом", "Гиганте"],
	["Высокий", "Высокого", "Высокому", "Высокого", "Высоким", "Высоком"],
	["Крепкий", "Крепкого", "Крепкому", "Крепкого", "Крепким", "Крепком"],
]);

//Starts the battle with the Angry state
const ENEMY_PREFIX_ANGRY_RU = makeRussianNames([
	["Злой", "Злого", "Злому", "Злого", "Злым", "Злом"],
	["Безумный", "Безумного", "Безумному", "Безумного", "Безумным", "Безумном"],
	["Яростный", "Яростного", "Яростному", "Яростного", "Яростным", "Яростном"],
	["Бешенный", "Бешенного", "Бешенному", "Бешенного", "Бешенным", "Бешенном"],
	["Буйный", "Буйного", "Буйному", "Буйного", "Буйным", "Буйном"],
	["Раздражённый", "Раздражённого", "Раздражённому", "Раздражённого", "Раздражённым", "Раздражённом"],
]);

//Metal
const ENEMY_PREFIX_METAL_RU = makeRussianNames([
	["Металлический", "Металлического", "Металлическому", "Металлического", "Металлическим", "Металлическом"],
]);

//+Talk lvl
const ENEMY_PREFIX_TALK_RU = makeRussianNames([
	["Придурок", "Придурка", "Придурку", "Придурка", "Придурком", "Придурке"],
	["Балабол", "Балабола", "Балаболу", "Балабола", "Балаболом", "Балаболе"],
	["Болтун", "Болтуна", "Болтуну", "Болтуна", "Болтуном", "Болтуне"],
	["Болтливый", "Болтливого", "Болтливому", "Болтливого", "Болтливым", "Болтливом"],
	["Красноречивый", "Красноречивого", "Красноречивому", "Красноречивого", "Красноречивым", "Красноречивом"],
	["Общительный", "Общительного", "Общительному", "Общительного", "Общительным", "Общительном"],
	["Шумный", "Шумного", "Шумному", "Шумного", "Шумным", "Шумном"],
]);

//+Sight lvl
const ENEMY_PREFIX_SIGHT_RU = makeRussianNames([
	["Внимательный", "Внимательного", "Внимательному", "Внимательного", "Внимательным", "Внимательном"],
	["Глазастый", "Глазастого", "Глазастому", "Глазастого", "Глазастым", "Глазастом"],
	["Впечатлительный", "Впечатлительного", "Впечатлительному", "Впечатлительного", "Впечатлительным", "Впечатлительном"],
	["Извращённый", "Извращённого", "Извращённому", "Извращённого", "Извращённым", "Извращённом"],
	["Смотрящий", "Смотрящего", "Смотрящему", "Смотрящего", "Смотрящим", "Смотрящем"],
]);

//+Maso lvl, +25% Stamina, +25% Energy
const ENEMY_PREFIX_MASO_RU = makeRussianNames([
	["Мазохист", "Мазохиста", "Мазохисту", "Мазохиста", "Мазохистом", "Мазохисте"],
	["Каблук", "Каблука", "Каблуку", "Каблука", "Каблуком", "Каблуке"],
	["Петух", "Петуха", "Петуху", "Петуха", "Петухом", "Петухе"],
	["Покорный", "Покорного", "Покорному", "Покорного", "Покорным", "Покорном"],
]);

//+Sado lvl, +10% Strength, +10% Dexterity, +10% Agility
const ENEMY_PREFIX_SADO_RU = makeRussianNames([
	["Садист", "Садиста", "Садисту", "Садиста", "Садистом", "Садисте"],
	["Бессердечный", "Бессердечного", "Бессердечному", "Бессердечного", "Бессердечным", "Бессердечном"],
	["Властный", "Властного", "Властному", "Властного", "Властным", "Властном"],
]);

//No effect
const ENEMY_PREFIX_NEUTRAL_RU = makeRussianNames([
	["Простак", "Простака", "Простаку", "Простака", "Простаком", "Простаке"],
	["Скучный", "Скучного", "Скучному", "Скучного", "Скучным", "Скучном"],
	["Странный", "Странного", "Странному", "Странного", "Странным", "Странном"],
	["Лысый", "Лысого", "Лысому", "Лысого", "Лысым", "Лысом"],
	["Сиплый", "Сиплого", "Сиплому", "Сиплого", "Сиплым", "Сиплом"],
	["Тихий", "Тихого", "Тихому", "Тихого", "Тихым", "Тихом"],
	["Вонючий", "Вонючего", "Вонючему", "Вонючего", "Вонючим", "Вонючем"],
]);

function makeRussianNames(namesWithCases) {
	return namesWithCases.map(function (nameCases) {
		TextManager.russianTextFormatter.setDeclensions(nameCases);

		return nameCases[0];
	});
}
