//Names

const ENEMY_NAMES_GENERIC_SCH = [
	"托尼", "史提芬", "索迩", "洛吉", "布鲁斯", "尼克", "柯林顿", "萨姆", "罗蒂", "斯科特", "约翰", "彼特", "汪", "明",
	"汉克", "恰拉", "埃里克", "盖斯", "路易斯", "吉米", "菲路", "艾里克", "甘", "胜", "皮彦", "吉彦", "梅利普",  "金田", 
	"约翰", "巴里", "春", "克拉克", "卡尔", "奥利巴", "卡塔", "拉尔夫", "文肯", "罗尼", "沃利", "迪克", "七志", "铁雄", 
	"维克托", "阿瑟", "西蒙", "巴特", "法拉特", "辰", "杰克", "纳葛", "法鲁", "塔肯", "甘迪", "幸弘", "本木",  
	"托本", "希斯", "古里格林", "杰弗里", "希蒙", "托怀特", "塞蒂克", "托克奇", "广树", "佐藤", "霍帕", "陈", "皮特", 
	"莲", "乔治", "达利克", "本", "丹", "阿特尔", "克里斯蒂", "多基", "塔尔克", "法尔特", "路塔", "吉玛", "伽斯塔", "哥顿", 
	"托马斯", "布鲁克", "偌吉", "卡门", "盖布乔", "凡尔卡斯", "彭", "竹", "山", "仁木", "多摩雄", "加里科森", "秀", "阿里", "电彻",
	"科比", "奇澈", "珀珀", "霍克", "莫盖塔", "胜男", "波平", "田间", "米助", "辛乐思", "广志", "野原", "多尔曼", "泰萨", "比古滋", 
	"杰恩", "利艾姆", "纳鲁", "赫兰", "索力马奇", "扎克顿", "纳崔恩", "布林肯", "王", "艾特", "图", "索尼", "诺拉", "切米",
	"帕普斯", "利姆鲁", "吉昂", "赛西路", "塞加尔", "安梭尼", "派蒂", "莫米曼", "潘恩", "罗德斯", "俄卓", "希其", "艾力", "巴克",
	"可可西", "卡卡希", "鸣茶", "巴基", "戈梅斯", "波利潘", "阿鲁", "贝吉蒙", "卡丘吉", "尤因普", "伊吉斯", "卡门", "无名", "马克",
	"官兵卫", "克里纽", "奥博艾特", "怀斯雷特", "阿奈基", "肯", "耐克", "丈", "卡耐基", "安东尼", "特尔", "琼", "贝索斯", "杰夫"
];

const ENEMY_NAMES_GENERIC_TCH = [
	"托尼", "史提芬", "索邇", "洛吉", "布魯斯", "尼克", "柯林頓", "薩姆", "羅蒂", "斯科特", "約翰", "彼特", "汪", "明",
	"漢克", "恰拉", "埃裏克", "蓋斯", "路易斯", "吉米", "菲路", "艾裏克", "甘", "勝", "皮彥", "吉彥", "梅利普",  "金田", 
	"約翰", "巴裏", "春", "克拉克", "卡爾", "奧利巴", "卡塔", "拉爾夫", "文肯", "羅尼", "沃利", "迪克", "七誌", "鐵雄", 
	"維克托", "阿瑟", "西蒙", "巴特", "法拉特", "辰", "傑克", "納葛", "法魯", "塔肯", "甘迪", "幸弘", "本木",  
	"托本", "希斯", "古裏格林", "傑弗裏", "希蒙", "托懷特", "塞蒂克", "托克奇", "廣樹", "佐藤", "霍帕", "陳", "皮特", 
	"蓮", "喬治", "達利克", "本", "丹", "阿特爾", "克裏斯蒂", "多基", "塔爾克", "法爾特", "路塔", "吉瑪", "伽斯塔", "哥頓", 
	"托馬斯", "布魯克", "偌吉", "卡門", "蓋布喬", "凡爾卡斯", "彭", "竹", "山", "仁木", "多摩雄", "加裏科森", "秀", "阿裏", "電徹",
	"科比", "奇澈", "珀珀", "霍克", "莫蓋塔", "勝男", "波平", "田間", "米助", "辛樂思", "廣誌", "野原", "多爾曼", "泰薩", "比古滋", 
	"傑恩", "利艾姆", "納魯", "赫蘭", "索力馬奇", "札克頓", "納崔恩", "布林肯", "王", "艾特", "圖", "索尼", "諾拉", "切米",
	"帕普斯", "利姆魯", "吉昂", "賽西路", "塞加爾", "安梭尼", "派蒂", "莫米曼", "潘恩", "羅德斯", "俄卓", "希其", "艾力", "巴克",
	"可可西", "卡卡希", "鳴茶", "巴基", "戈梅斯", "波利潘", "阿魯", "貝吉蒙", "卡丘吉", "尤因普", "伊吉斯", "卡門", "無名", "馬克",
	"官兵衛", "克裏紐", "奧博艾特", "懷斯雷特", "阿奈基", "肯", "耐克", "丈", "卡耐基", "安東尼", "特爾", "瓊", "貝索斯", "傑夫"
];

const ENEMY_NAMES_THUG_SCH = [
	"兰布尔", "科雷", "托米", "朱安", "大吾", "约翰逊", "克里曼", "拉里", "强尼", "纳里多", "唐科", "狄克", "威吉", 
	"乔伊", "霍埃斯", "马乌斯", "瓦尼拉", "艾斯", "乔乔", "迪奥", "布兰度", "斯皮特", "瓦根", "威斯特", "修斯", "诺斯", 
	"库鲁", "杰伊", "兴光", "钱力", "宪", "布鲁斯", "韦鲁斯", "罗密欧", "卡菲", "帕巴", "尼可", "皮阿滋", "奥根", "韦斯特",
	"无根", "有根", "奥卡米", "一郎", "米田", "一辉", "悠一", "狮户", "康生", "冈", "列克", "多古", "旺财", "波奇",
	"奎基",
	
	"阿福", "老基", "济寡", "龙傲天", "纪衡", "恶棍"
];

const ENEMY_NAMES_THUG_TCH = [
	"蘭布爾", "科雷", "托米", "朱安", "大吾", "約翰遜", "克裏曼", "拉裏", "強尼", "納裏多", "唐科", "狄克", "威吉", 
	"喬伊", "霍埃斯", "馬烏斯", "瓦尼拉", "艾斯", "喬喬", "迪奧", "布蘭度", "斯皮特", "瓦根", "威斯特", "修斯", "諾斯", 
	"庫魯", "傑伊", "興光", "錢力", "憲", "布魯斯", "韋魯斯", "羅密歐", "卡菲", "帕巴", "尼可", "皮阿滋", "奧根", "韋斯特",
	"無根", "有根", "奧卡米", "一郎", "米田", "一輝", "悠一", "獅戶", "康生", "岡", "列克", "多古", "旺財", "波奇",
	"奎基",
	
	"老燦", "阿舍"
];

const ENEMY_NAMES_GOBLIN_SCH = [
	"哥比", "哥布克", "哥布洛", "哥布旺", "哥布一", "哥布斯", "哥布布", "哥布纳玛", "哥布雷姆",
	"哥布哥布", "哥布丁", "哥布夫", "哥布多", "哥布滋", "哥布典", "哥布普", "哥布", "哥布尤基",
	"哥布潘", "哥布布哥", "哥布拉", "哥布门", "哥布思", "哥布思奇", "哥布多托", "哥布伊奇",
	"哥布寺", "哥布米多利", "哥布伊古", "哥布布鲁", "哥布皮", "哥布屑", "哥布怀滋", "哥布纳", "哥布卡",
	
	"老谢", "戈布", "青技霸", "阿啾"
];

const ENEMY_NAMES_GOBLIN_TCH = [
	"哥比", "哥布克", "哥布洛", "哥布旺", "哥布一", "哥布斯", "哥布布", "哥布納瑪", "哥布雷姆",
	"哥布哥布", "哥布丁", "哥布夫", "哥布多", "哥布滋", "哥布典", "哥布普", "哥布", "哥布尤基",
	"哥布潘", "哥布布哥", "哥布拉", "哥布門", "哥布思", "哥布思奇", "哥布多托", "哥布伊奇",
	"哥布寺", "哥布米多利", "哥布伊古", "哥布布魯", "哥布皮", "哥布屑", "哥布懷滋", "哥布納", "哥布卡"
];

const ENEMY_NAMES_NERD_SCH = [
	"木场", "奥布", "健", "田中", "末雄", "佐藤", "日野", "饭山", "三善", "鹤卷", "本田", "园田", 
	"富野", "博雄", "冈田", "俊雄", "耕平", "森", "多树", "莫列滋", "托拉", "诺阿拉", "彻", "苏斯奥", "莫麦拉",
	"哈卡", "桥田", "至", "尼偌", "曼多克塞", "尼强", "努鲁普", "普哥", "凯尤", "贺特",
	"戴肯", "盖纳", "卡拉", "正行", "纳多", "基古", "浩", "托利加", "庞克塞", "大辉", "蒂奥",
	"塞克拉", "达布", "权藏", "莱汀", "马帕", "埃文", "尤弗", "莱丁克桑", "夏夫", "韦德", "艾吉", 
	"角川", "元芳", "梅古", "范扎", "阿特拉斯", "法劳控", "万南梦", "哈尔", "普拉奇纳姆", "马贝拉斯", "レッド",
	"米斯特", "梅比乌斯", "梅特鲁", "弗洛", "艾尼克斯", "艾乌欧",	"阿卡比", "帕尔提诺", "艾佛斯", "克罗克", "艾普",
	"斯塔克", "梅比", "尼托洛", "普拉斯", "奥伽斯", "莱亚", "拉鲁", "斯卡尔", "鲁尼", "悠好", "其特鲁", 
	"艾努埃卢思", "多摩", "托伊哈", "TENGA", "莱多", "吉加", "崎", "米克", "梅特", "兰滋", "艾西斯", "哈比", "来福",
	"阿尔塔", "古斯曼", "阿尼普莱", "赫比恰", "马克斯", "阿克艾玛", "法特", "尤里翁", "普拉姆", "布洛克",
	"姆安", "派克汀", "缪斯", "西克斯", "秋浦", "霍洛克", "莱提普",
	
	"赔钱, 狷狂",  //Ci-en
	
	"谢翔", "笑川", "清癫", "黄师傅", "乃蔻"
];

const ENEMY_NAMES_NERD_TCH = [
	"木場", "奧布", "健", "田中", "末雄", "佐藤", "日野", "飯山", "三善", "鶴卷", "本田", "園田", 
	"富野", "博雄", "岡田", "俊雄", "耕平", "森", "多樹", "莫列滋", "托拉", "諾阿拉", "徹", "蘇斯奧", "莫麥拉",
	"哈卡", "橋田", "至", "尼偌", "曼多克塞", "尼強", "努魯普", "普哥", "凱尤", "賀特",
	"戴肯", "蓋納", "卡拉", "正行", "納多", "基古", "浩", "托利加", "龐克塞", "大輝", "蒂奧",
	"塞克拉", "達布", "權藏", "萊汀", "馬帕", "埃文", "尤弗", "萊丁克桑", "夏夫", "韋德", "艾吉", 
	"角川", "元芳", "梅古", "範札", "阿特拉斯", "法勞控", "萬南夢", "哈爾", "普拉奇納姆", "馬貝拉斯", "レッド",
	"米斯特", "梅比烏斯", "梅特魯", "弗洛", "艾尼克斯", "艾烏歐",	"阿卡比", "帕爾提諾", "艾佛斯", "克羅克", "艾普",
	"斯塔克", "梅比", "尼托洛", "普拉斯", "奧伽斯", "萊亞", "拉魯", "斯卡爾", "魯尼", "悠好", "其特魯", 
	"艾努埃盧思", "多摩", "托伊哈", "TENGA", "萊多", "吉加", "崎", "米克", "梅特", "蘭滋", "艾西斯", "哈比", "來福",
	"阿爾塔", "古斯曼", "阿尼普萊", "赫比恰", "馬克斯", "阿克艾瑪", "法特", "尤裏翁", "普拉姆", "布洛克",
	"姆安", "派克汀", "繆斯", "西克斯", "秋浦", "霍洛克", "萊提普",
	
	"赔钱, 狷狂",  //Ci-en
	
	"插鮑伯", "樂定", "阿米", "重佑哥"
];


const ENEMY_NAMES_ROGUE_SCH = [
	"阿鲁塔", "康纳", "艾德", "埃滋", "杰伊", "弗莱", "阿乌蒂", "埃卢诺", "阿特威尔", "夏奥", "尹", "神威", "暗影",
	"塔米鲁", "加鲁尼埃", "塔拉鲁", "罗贝鲁", "迈路滋", "瓦伦", "乔梵", "佩托鲁", "库拉乌", "马利奥", "拉", "忍",
	"列奥纳多", "安东尼奥", "尼柯", "玛鲁格", "科里斯", "本", "詹姆斯", "查理", "斯特特", "伍兹", "朧丸", "影",
	"莱纳尔多", "维斯帕", "维多", "威尔逊", "尤塔", "齐林", "蒙卡", "悠", "古拉比", "赛库鲁", "仁哲", "巴克",
	
	"斯坦因", "博文", "磊"
];

const ENEMY_NAMES_ROGUE_TCH = [
	"阿魯塔", "康納", "艾德", "埃滋", "傑伊", "弗萊", "阿烏蒂", "埃盧諾", "阿特威爾", "夏奧", "尹", "神威", "暗影",
	"塔米魯", "加魯尼埃", "塔拉魯", "羅貝魯", "邁路滋", "瓦倫", "喬梵", "佩托魯", "庫拉烏", "馬利奧", "拉", "忍",
	"列奧納多", "安東尼奧", "尼柯", "瑪魯格", "科裏斯", "本", "詹姆斯", "查理", "斯特特", "伍茲", "朧丸", "影",
	"萊納爾多", "維斯帕", "維多", "威爾遜", "尤塔", "齊林", "蒙卡", "悠", "古拉比", "賽庫魯", "仁哲", "巴克"
];

const ENEMY_NAMES_HOMELESS_SCH = [
	"葛米", "银", "哈纳", "本恩", "萨托", "亚玛", "孔恩", "阿姆", "洛伊", "奇玛", "艾斯", "达缇", "阿诺", "尼克", "齐塔", "达姆", "奇多", 
	"纳古", "滋塔", "尼奥", "亚齐", "尼莫", "莱塔", "柯特", "拿伊", "诺尼", "布拉", "伊托", "诺亚", "玛奇", "路达", "凯伊", "希特", "卡德", 
	"阿兹", "西犸", "艾嘉", "索恩", "纳奥", "托拿", "希尤", "塞伊", "西迪", "亚路", "尼契", "奇亚", "梅达", "珀利", "班恩", "提奇", "托乌", 
	"多奥", "吉尤", "乌斯", "那拉", "卡纳", "奥科", "伊艾", "纳其", "昂达", "希尤", "缇尼", "伊尼", "罗多", "拉葛", "波乌", "捷德", "卡梅", "塞恩", 
	"尼恩", "库利", "利恩", "雅姆", "奇亚", "皮茨", "科洛", "戴伊", "马奥", "皮拉", "弗萨", "弗里", "伊扎", "铎多", "扎波", "贝吉", "伊达",

	"微醺云"
];

const ENEMY_NAMES_HOMELESS_TCH = [
	"葛米", "銀", "哈納", "本恩", "薩托", "亞瑪", "孔恩", "阿姆", "洛伊", "奇瑪", "艾斯", "達緹", "阿諾", "尼克", "齊塔", "達姆", "奇多", 
    "納古", "滋塔", "尼奧", "亞齊", "尼莫", "萊塔", "柯特", "拿伊", "諾尼", "布拉", "伊托", "諾亞", "瑪奇", "路達", "凱伊", "希特", "卡德", 
    "阿茲", "西獁", "艾嘉", "索恩", "納奧", "托拿", "希尤", "塞伊", "西迪", "亞路", "尼契", "奇亞", "梅達", "珀利", "班恩", "提奇", "托烏", 
    "多奧", "吉尤", "烏斯", "那拉", "卡納", "奧科", "伊艾", "納其", "昂達", "希尤", "緹尼", "伊尼", "羅多", "拉葛", "波烏", "捷德", "卡梅", "塞恩", 
    "尼恩", "庫利", "利恩", "雅姆", "奇亞", "皮茨", "科洛", "戴伊", "馬奧", "皮拉", "弗薩", "弗里", "伊紮", "鐸多", "紮波", "貝吉", "伊達"
];

const ENEMY_NAMES_LIZARDMAN_SCH = [
	"扎留斯", "克鲁修", "托卡盖", "斯吉塔", "亚莫利", "卡奈凯比", "伊默里", "拉克鲁", 
	"尤利恩", "伊古艾纳", "海比", "哈丘鲁", "拜帕", "卡梅利奥", "弗特阿戈", "塞卢斯", 
	"提尤", "奇塔迪古", "艾路玛吉", "阿卡玛", "阿鲁迪奥", "盖克", "阿克伊鲁", "多里可", "巴巴利",
	"海德拉", "尼索", "尼海恩", "修蒙", "雷奥帕德", "卡布特", "切诺", "奥尼普雷托", "艾奥齐塔",
	"米密兹", "玛兹卡萨", "莫托尔", "伊瓦", "盖瓦纳", "皮塔兹", "邦德多", "斯托克斯",
	"阿里盖塔", "埃加摩", "伊古安纳"
];

const ENEMY_NAMES_LIZARDMAN_TCH = [
	"札留斯", "克魯修", "托卡蓋", "斯吉塔", "亞莫利", "卡奈凱比", "伊默裏", "拉克魯", 
	"尤利恩", "伊古艾納", "海比", "哈丘魯", "拜帕", "卡梅利奧", "弗特阿戈", "塞盧斯", 
	"提尤", "奇塔迪古", "艾路瑪吉", "阿卡瑪", "阿魯迪奧", "蓋克", "阿克伊魯", "多裏可", "巴巴利",
	"海德拉", "尼索", "尼海恩", "修蒙", "雷奧帕德", "卡布特", "切諾", "奧尼普雷托", "艾奧齊塔",
	"米密茲", "瑪茲卡薩", "莫托爾", "伊瓦", "蓋瓦納", "皮塔茲", "邦德多", "斯托克斯",
	"阿裏蓋塔", "埃加摩", "伊古安納"
];

const ENEMY_NAMES_ORC_SCH = [
	"布乌", "佟奇切", "坡奇", "珀卢克", "罗索", "皮古勒特", "哈姆", "左卫门", "霍克", "乌龙", "贝布", "皮吉", "古恩塔",
	"库洛普", "皮古", "哈卡尔", "普阿", "佩帕", "佟佟", "托利托", "哈特", "巴尼布", "罗斯", "列库", "坦", "斯奈", "巴拉",
	"莫莫", "希雷", "卡西拉", "缇鲁", "米米", "约克", "迪勒库", "兰德", "贝布", "堂托勒", "伊贝利克", "佟蒂奇", "普鲁克奇",
	"卡奇", "冬", "洛茨塔", "巴杰姆", "布塔曼", "艾斯可古", "獠牙", "皮珀", "培根", "可本", "佟迪基", "库西", "利兹恩",
	"猪哥", "佩帕", "佐治", "布里恩", "奥库斯", "马库贝斯", "柳", "库金", "苏苏", "苏可鲁法", "多梅斯", "特克斯",
	"肉", "布斯塔", "可唐", "恪咚", "唐布", "哈米鲁冬", "威灵顿", "布比", "本", "布坦", "噗太郎", "噗扬",
	"姆", "霍古", "修伯恩", "刻匈", "珀尔哥", "塞鲁多", "修斯", "斯贝亚", "瓦尔郡", "普阿阿", "丘", "多艾基",
	"巴鲁肯", "汉兹尔", "格雷斯", "普罗塞", "斯埃鲁", "普尔科", "比弗", "雷托奥", "哈努托",
	
	"石栋"
];

const ENEMY_NAMES_ORC_TCH = [
	"布烏", "佟奇切", "坡奇", "珀盧克", "羅索", "皮古勒特", "哈姆", "左衛門", "霍克", "烏龍", "貝布", "皮吉", "古恩塔",
	"庫洛普", "皮古", "哈卡爾", "普阿", "佩帕", "佟佟", "托利托", "哈特", "巴尼布", "羅斯", "列庫", "坦", "斯奈", "巴拉",
	"莫莫", "希雷", "卡西拉", "緹魯", "米米", "約克", "迪勒庫", "蘭德", "貝布", "堂托勒", "伊貝利克", "佟蒂奇", "普魯克奇",
	"卡奇", "冬", "洛茨塔", "巴傑姆", "布塔曼", "艾斯可古", "獠牙", "皮珀", "培根", "可本", "佟迪基", "庫西", "利茲恩",
	"豬哥", "佩帕", "佐治", "布裏恩", "奧庫斯", "馬庫貝斯", "柳", "庫金", "蘇蘇", "蘇可魯法", "多梅斯", "特克斯",
	"肉", "布斯塔", "可唐", "恪咚", "唐布", "哈米魯冬", "威靈頓", "布比", "本", "布坦", "噗太郎", "噗揚",
	"姆", "霍古", "修伯恩", "刻匈", "珀爾哥", "塞魯多", "修斯", "斯貝亞", "瓦爾郡", "普阿阿", "丘", "多艾基",
	"巴魯肯", "漢茲爾", "格雷斯", "普羅塞", "斯埃魯", "普爾科", "比弗", "雷托奧", "哈努托",
	
	"重佑哥", "光"
];

const ENEMY_NAMES_WEREWOLF_SCH = [
	"凯文", "卡鲁", "路加", "汪汪", "多基", "远也", "彭", "大神", "莫罗", "金路", "加隆", "疾风丸", 
	"波奇", "哈奇", "克罗", "拉西", "洛奇", "帕托拉修", "基阿", "铎古", "汀格", "牙", "加鲁鲁", "狂牙",
	"哈提", "马尔科", "奥多涅鲁", "阿克拉", "拉克夏", "波尔夫钢古", "西贝利亚", "齐弗", "里卡卢特", "赫罗", "定春",
	"伊奇", "奶酪", "斯林奇", "尼格", "威兹", "耐兹", "海伊洛", "贝鲁曼", "多伯", "齐多啦", "艾佐", "戴亚",

	"德克兰德", "刀疤", "巨狼杰霸", "格雷迈恩"
];

const ENEMY_NAMES_WEREWOLF_TCH = [
	"凱文", "卡魯", "路加", "汪汪", "多基", "遠也", "彭", "大神", "莫羅", "金路", "加隆", "疾風丸", 
	"波奇", "哈奇", "克羅", "拉西", "洛奇", "帕托拉修", "基阿", "鐸古", "汀格", "牙", "加魯魯", "狂牙",
	"哈提", "馬爾科", "奧多涅魯", "阿克拉", "拉克夏", "波爾夫鋼古", "西貝利亞", "齊弗", "裏卡盧特", "赫羅", "定春",
	"伊奇", "奶酪", "斯林奇", "尼格", "威茲", "耐茲", "海伊洛", "貝魯曼", "多伯", "齊多啦", "艾佐", "戴亞",

	"犽"
];

const ENEMY_NAMES_YETI_SCH = [
	"布鲁", "迈克", "斯诺艾斯", "尤奇", "大白", "萨斯卡其", "芝麻", "北极", "冈古", "格利", 
	"佟凯", "本田", "米库拉", "卡欧路", "齐迪", "玛多古", "拉塞路", "努多尔", "哈罗卢多", "索拉其",
	"佐治", "狲", "塞扬", "吾空", "吾饭", "布萝利", "贝吉嗒", "科恩洛特", "古罗多", "庞虎",
	"赤木", "杰拉", "拉潘吉", "奥拉", "乌坦恩", "多维恩", "夏帕尼", "艾梵",
	
	"三次郎", //Ci-en
	
	"蒸聋腥君"
];

const ENEMY_NAMES_YETI_TCH = [
	"布魯", "邁克", "斯諾艾斯", "尤奇", "大白", "薩斯卡其", "芝麻", "北極", "岡古", "格利", 
	"佟凱", "本田", "米庫拉", "卡歐路", "齊迪", "瑪多古", "拉塞路", "努多爾", "哈羅盧多", "索拉其",
	"佐治", "猻", "塞揚", "吾空", "吾飯", "布蘿利", "貝吉嗒", "科恩洛特", "古羅多", "龐虎",
	"赤木", "傑拉", "拉潘吉", "奧拉", "烏坦恩", "多維恩", "夏帕尼", "艾梵",

	"三次郎", //Ci-en
	
	"卜祿","巨巨"
];


const ENEMY_NAMES_SLIME_SCH = [
	"利姆路", "戈米", "噗哟", "啫喱", "饼", "贝司", "棉花糖", "奶油", "拉梅", "奶酪", "泡沫", "梅林", 
	"莱特", "塔瓦", "波古", "多啦戈", "獠牙", "斯拉皮", "斯拉林", "荷伊敏", "佐助", "阿奇拉", "史莱林",
	"年糕", "莱姆莱姆", "多罗多罗", "黏滑黏滑", "珀利", "荷夏", "淀粉", "硅胶", "啪嗒啪嗒", "古拉奇", "胶水",
	"乌布历咕", "闪闪", "俄埃斯", "埃姆艾路"
];

const ENEMY_NAMES_SLIME_TCH = [
	"利姆路", "戈米", "噗喲", "啫喱", "餅", "貝司", "棉花糖", "奶油", "拉梅", "奶酪", "泡沫", "梅林", 
	"萊特", "塔瓦", "波古", "多啦戈", "獠牙", "斯拉皮", "斯拉林", "荷伊敏", "佐助", "阿奇拉", "史萊林",
	"年糕", "萊姆萊姆", "多羅多羅", "黏滑黏滑", "珀利", "荷夏", "澱粉", "矽膠", "啪嗒啪嗒", "古拉奇", "膠水",
	"烏布歷咕", "閃閃", "俄埃斯", "埃姆艾路"
];


const ENEMY_NAMES_GUARD_SCH = [
	"羽恬", "一击必发", "竣君", "蒋志成", "阿逸", "陶志韩", "一日清醒", "文松", "大勾八", "王灿", "阿任"
];  

const ENEMY_NAMES_GUARD_TCH = [
	"一擊必發", "阿賢", "竣君", "史密提", "然先"
];

const ENEMY_NAMES_PRISONER_SCH = [
	"七叶", "古德尔"
];  

const ENEMY_NAMES_PRISONER_TCH = [
	"塞拉斯", "文"
];


const ENEMY_NAMES_VISITOR_MALE_SCH = [
	"戈梅鲁", "杰", "莫利贝特", "奥马鲁", "萨古", "武", "朗基", "修尔戈", "哈里", "山", "洛吉", "利布", "马克", "特兰普", "格恩",
	"史提夫", "杰夫", "拉里", "阿拉多", "迈克尔", "尼克", "科里", "佐汀", "哈马", "久京", "康介", "瓦尤", "西诺姆",
	"杰顿", "安格斯", "萨斯", "克罗克", "迪阿戈", "布莱恩", "多诺邦", "麦克斯", "捷克", "本斯", "奥斯汀",
	"古里戈力奥", "肖恩", "里肯", "法伦", "诺克", "霍伯", "杨", "博布", "多拉鲁多", "嘉文", "托伊", "安迪", "伍德",
	"健二", "莫托奇", "优", "修", "克劳德", "扎克", "卡鲁", "古雷斯", "巴连", "伽斯塔", "奥斯", "维伊尤", "埃托兰",
	"山本", "田中", "昂斯", "奥拉", "孙", "格莫拉", "多拉格", "巴鲁", "兹", "张", "浅田", "陈", "吉姆", "米奇"
];

const ENEMY_NAMES_VISITOR_MALE_TCH = [
	"戈梅魯", "傑", "莫利貝特", "奧馬魯", "薩古", "武", "朗基", "修爾戈", "哈裏", "山", "洛吉", "利布", "馬克", "特蘭普", "格恩",
	"史提夫", "傑夫", "拉裏", "阿拉多", "邁克爾", "尼克", "科裏", "佐汀", "哈馬", "久京", "康介", "瓦尤", "西諾姆",
	"傑頓", "安格斯", "薩斯", "克羅克", "迪阿戈", "布萊恩", "多諾邦", "麥克斯", "捷克", "本斯", "奧斯汀",
	"古裏戈力奧", "肖恩", "裏肯", "法倫", "諾克", "霍伯", "楊", "博布", "多拉魯多", "嘉文", "托伊", "安迪", "伍德",
	"健二", "莫托奇", "優", "修", "克勞德", "札克", "卡魯", "古雷斯", "巴連", "伽斯塔", "奧斯", "維伊尤", "埃托蘭",
	"山本", "田中", "昂斯", "奧拉", "孫", "格莫拉", "多拉格", "巴魯", "茲", "張", "淺田", "陳", "吉姆", "米奇"
];

const ENEMY_NAMES_VISITOR_FEMALE_SCH = [
	"可莉", "莉莉", "米莉亚", "卡里娜", "诺拉米", "珍妮佛", "芽衣", "索尼娅", "蕾娜", "芙拉", "未来", "卡特吉娜", "香",
	"法子", "久美子", "明美", "美奈子", "卡妮特", "艾玛", "花子", "真央", "爱", "凯西", "贝阿托莉丝", "马里莎", "幽幽子", "莱姆",
	"安妮", "皮莉米", "嘉妮特", "米夏", "塞琳娜", "米兰达", "比娜", "克拉莉丝", "芭比", "路伊", "艾丽卡", "摩耶", "和美", "三玖"		
];

const ENEMY_NAMES_VISITOR_FEMALE_TCH = [
	"可莉", "莉莉", "米莉亞", "卡里娜", "諾拉米", "珍妮佛", "芽衣", "索尼婭", "蕾娜", "芙拉", "未來", "卡特吉娜", "香",
    "法子", "久美子", "明美", "美奈子", "卡妮特", "艾瑪", "花子", "真央", "愛", "凱西", "貝阿托莉絲", "馬里莎", "幽幽子", "萊姆",
    "安妮", "皮莉米", "嘉妮特", "米夏", "塞琳娜", "米蘭達", "比娜", "克拉莉絲", "芭比", "路伊", "艾麗卡", "摩耶", "和美", "三玖"		
];

const ENEMY_NAMES_VISITOR_UNISEX_SCH = [
	"忍", "凛", "路卡", "希卡路", "寇鲁", "拉米", "莱伊", "卓比", "可因", "奈塞", "珀", "洛洛", "鹭"
];

const ENEMY_NAMES_VISITOR_UNISEX_TCH = [
	"忍", "凜", "路卡", "希卡路", "寇魯", "拉米", "萊伊", "卓比", "可因", "奈塞", "珀", "洛洛", "鷺"
];


//Prefix

//低ステータス
const ENEMY_PREFIX_BAD_SCH = ["土掉渣的", "肮脏的", "不起眼的", "菜鸟", "笨蛋", "步履蹒跚的", "软弱的", "便秘的", "睡眠不足的", "菜得抠脚的", "缩卵的",  "令人摇头的", "病弱的", "穷鬼", "臭烘烘的", "杂鱼"];
const ENEMY_PREFIX_BAD_TCH = ["土掉渣的", "骯臟的", "不起眼的", "菜鳥", "笨蛋", "步履蹣跚的", "軟弱的", "便秘的", "睡眠不足的", "菜得摳腳的", "縮卵的",  "令人搖頭的", "病弱的", "窮鬼", "臭烘烘的", "雜魚"];

const ENEMY_PREFIX_DRUNK_SCH = ["微醺的", "烂醉如泥的", "醉成傻比的", "醉酒的", "醉鬼"];
const ENEMY_PREFIX_DRUNK_TCH = ["微醺的", "爛醉如泥的", "醉成傻比的", "醉酒的", "醉鬼"];
//空腹
const ENEMY_PREFIX_HUNGRY_SCH = ["饿肚子的", "饥肠辘辘的", "空腹"];
const ENEMY_PREFIX_HUNGRY_TCH = ["餓肚子的", "饑腸轆轆的", "空腹"];
//飢え
const ENEMY_PREFIX_STARVING_SCH = ["骨瘦如柴的", "饥渴的"];
const ENEMY_PREFIX_STARVING_TCH = ["骨瘦如柴的", "饑渴的"];
//力が弱い、体力なし
const ENEMY_PREFIX_WEAK_SCH = ["无力的", "贫弱", "豆芽菜", "手无缚鸡之力的", "手无寸铁的", "运动不足的"];
const ENEMY_PREFIX_WEAK_TCH = ["無力的", "貧弱", "豆芽菜", "手無縛雞之力的", "手無寸鐵的", "運動不足的"];
//器用さが低い、精力低い
const ENEMY_PREFIX_INEPT_SCH = ["笨拙的", "毫无技术的", "素人", "无能的", "笨手笨脚的", "青涩的", "迟钝的", "经验不足的", "短小的", "包茎的", "阳痿的"];
const ENEMY_PREFIX_INEPT_TCH = ["笨拙的", "毫無技術的", "素人", "無能的", "笨手笨腳的", "青澀的", "遲鈍的", "經驗不足的", "短小的", "包莖的", "陽痿的"];
//遅い
const ENEMY_PREFIX_SLOW_SCH = ["呆笨的", "慢吞吞的", "呆滞的", "悠哉游哉的", "缓慢的", "木讷的", "打瞌睡的", "反射弧长的"];
const ENEMY_PREFIX_SLOW_TCH = ["呆笨的", "慢吞吞的", "呆滯的", "悠哉遊哉的", "緩慢的", "木訥的", "打瞌睡的", "反射弧長的"];
//忍耐なし、精力さらになし
const ENEMY_PREFIX_SENSITIVE_SCH = ["毫无毅力的", "没种的", "精液稀拉的", "毫无耐性的", "秒射的", "敏感的", "早漏的", "忍耐力差的", "不知忍耐为何物的"];
const ENEMY_PREFIX_SENSITIVE_TCH = ["毫無毅力的", "沒種的", "精液稀拉的", "毫無耐性的", "秒射的", "敏感的", "早漏的", "忍耐力差的", "不知忍耐為何物的"];

//高ステータス
const ENEMY_PREFIX_GOOD_SCH = ["强人", "技艺高超的", "一流的", "优秀的", "熟练的", "超级", "摔跤手", "强大的", "特牛逼的", "大", "猛的一笔的", "猛烈的", "坏坏的", "猛男", "威严的", "潇洒的", "厉害的", "不是开玩笑的"];
const ENEMY_PREFIX_GOOD_TCH = ["強人", "技藝高超的", "一流的", "優秀的", "熟練的", "超級", "摔跤手", "強大的", "特牛逼的", "大", "猛的一筆的", "猛烈的", "壞壞的", "猛男", "威嚴的", "瀟灑的", "厲害的", "不是開玩笑的"];
//エリート
const ENEMY_PREFIX_ELITE_SCH = ["精英", "令人生畏的", "冠军", "无败的", "无敌的", "极致的", "老司机", "超", "邪恶的", "皇家", "神", "悟道的", "特级", "屌炸天的", "领袖气质的", "最强的", "伟大的", "天才"];
const ENEMY_PREFIX_ELITE_TCH = ["精英", "令人生畏的", "冠軍", "無敗的", "無敵的", "極致的", "老司機", "超", "邪惡的", "皇家", "神", "悟道的", "特級", "屌炸天的", "領袖氣質的", "最強的", "偉大的", "天才"];
//力が強い、体力ある
const ENEMY_PREFIX_STRONG_SCH = ["强韧的", "浑身肌肉的", "猛男", "肌肉", "完美肉体的", "粉碎一切的", "破坏的", "神采奕奕的"];
const ENEMY_PREFIX_STRONG_TCH = ["強韌的", "渾身肌肉的", "猛男", "肌肉", "完美肉體的", "粉碎一切的", "破壞的", "神采奕奕的"];
//器用さが高い、精力高い
const ENEMY_PREFIX_DEXTEROUS_SCH = ["手巧的", "牛郎", "女见愁的", "男优", "技巧派的", "黄金手指", "精力的", "充满能量的"];
const ENEMY_PREFIX_DEXTEROUS_TCH = ["手巧的", "牛郎", "女見愁的", "男優", "技巧派的", "黃金手指", "精力的", "充滿能量的"];
//速い
const ENEMY_PREFIX_AGILE_SCH = ["音速的", "高速的", "忍者", "来无影的", "去无踪的", "疾风的"];
const ENEMY_PREFIX_AGILE_TCH = ["音速的", "高速的", "忍者", "來無影的", "去無蹤的", "疾風的"];
//忍耐強い、体力高い、精力さらに高い、射精量多い
const ENEMY_PREFIX_ENDURING_SCH = ["忍耐的", "坚强的", "绝伦的", "结实的", "耐操的", "汁男", "大喷泉", "情床高手", "欲望的", "经验丰富的", "一脸轻松的"];
const ENEMY_PREFIX_ENDURING_TCH = ["忍耐的", "堅強的", "絕倫的", "結實的", "耐操的", "汁男", "大噴泉", "情床高手", "欲望的", "經驗豐富的", "一臉輕鬆的"];

//童貞
const ENEMY_PREFIX_VIRGIN_SCH = ["处男"];
const ENEMY_PREFIX_VIRGIN_TCH = ["處男"];

//興奮状態
const ENEMY_PREFIX_HORNY_SCH = ["兴奋的", "变态", "一柱擎天的", "干劲十足的", "勃起的", "气喘如牛的", "亢奋的"];
const ENEMY_PREFIX_HORNY_TCH = ["興奮的", "變態", "一柱擎天的", "幹勁十足的", "勃起的", "氣喘如牛的", "亢奮的"];

//体格とチンポでかい
const ENEMY_PREFIX_BIG_SCH = ["大鸡巴的", "精液水坝的", "鸡巴扛肩上的", "又大又粗的", "巨大的", "高耸入云的", "大得吓人的"];
const ENEMY_PREFIX_BIG_TCH = ["大雞巴的", "精液水壩的", "雞巴扛肩上的", "又大又粗的", "巨大的", "高聳入雲的", "大得嚇人的"];


const ENEMY_PREFIX_ANGRY_SCH = ["愤怒的", "盛怒的", "怒气冲冲的", "一脸不爽的", "生闷气的", "怒发冲冠的", "激昂"];
const ENEMY_PREFIX_ANGRY_TCH = ["憤怒的", "盛怒的", "怒氣沖沖的", "一臉不爽的", "生悶氣的", "怒髮衝冠的", "激昂"];


const ENEMY_PREFIX_METAL_SCH = ["金属"];
const ENEMY_PREFIX_METAL_TCH = ["金屬"];


const ENEMY_PREFIX_TALK_SCH = ["喋喋不休的", "说相声的", "爱磨嘴皮子的", "吵闹的", "饶舌的", "唠唠叨叨的", "开黄腔的", "骚话连篇的"];
const ENEMY_PREFIX_TALK_TCH = ["喋喋不休的", "說相聲的", "愛閒聊的", "吵鬧的", "饒舌的", "嘮嘮叨叨的", "開黃腔的", "騷話連篇的"];

//見る
const ENEMY_PREFIX_SIGHT_SCH = ["视奸", "偷窥的", "瞄来瞄去的", "扫本", "凝视的", "两眼发直的", "望个不停的", "观察者"];
const ENEMY_PREFIX_SIGHT_TCH = ["視奸", "偷窺的", "瞄來瞄去的", "掃本", "凝視的", "兩眼發直的", "望個不停的", "觀察者"];


const ENEMY_PREFIX_MASO_SCH = ["抖M", "受虐狂", "受虐的"];
const ENEMY_PREFIX_MASO_TCH = ["抖M", "受虐狂", "受虐的"];


const ENEMY_PREFIX_SADO_SCH = ["抖S", "施虐狂", "施虐的"];
const ENEMY_PREFIX_SADO_TCH = ["抖S", "施虐狂", "施虐的"];

//効果なし
const ENEMY_PREFIX_NEUTRAL_SCH = ["普通的", "凡人", "没个性的", "一般的", "平凡的", "路人", "平均水平的", "打下手的", "庶民派", "平凡", "一抓一大把的", "平平无奇", "就是个", "量产型", "泛用的", "笑眯眯的", "起得早的"];
const ENEMY_PREFIX_NEUTRAL_TCH = ["普通的", "凡人", "沒個性的", "一般的", "平凡的", "路人", "平均水平的", "打下手的", "庶民派", "平凡", "一抓一大把的", "平平無奇", "就是個", "量產型", "泛用的", "笑瞇瞇的", "起得早的"];


